emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-12 Sun 18:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="author" content="ape" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd829c43">Setup</a>
<ul>
<li><a href="#orgb320b31">Auto-tangle</a></li>
<li><a href="#org09d2146">Use-package</a></li>
<li><a href="#org003a0f0">Automatic Package Updates</a></li>
</ul>
</li>
<li><a href="#orgccb6c28">General Emacs</a>
<ul>
<li><a href="#org7bb2e25">UI Configurations</a></li>
<li><a href="#org25e80ba">Dired</a></li>
<li><a href="#org08b75f0">Proced</a></li>
<li><a href="#org998669f">Native Compilation</a></li>
<li><a href="#orgc887ef2">Goto last change</a></li>
<li><a href="#orga24e01f">Input Buffer, Directory Search</a></li>
<li><a href="#org1177e73">Helpful and Which-key</a></li>
</ul>
</li>
<li><a href="#org995643d">General Development</a>
<ul>
<li><a href="#org485f2a6">Line numbers</a></li>
<li><a href="#orgf45debc">Flyspell comments</a></li>
<li><a href="#orgfd002e4">Parens/delimiters</a></li>
<li><a href="#org686afa5">Magit</a></li>
<li><a href="#orgea034f5">Git-Gutter</a></li>
<li><a href="#orgb15578f">Highlight-indent-guide</a></li>
<li><a href="#orga4513d9">Company-Mode</a></li>
<li><a href="#org3d542bf">LSP and DAP</a></li>
<li><a href="#org351519b">Flycheck</a></li>
<li><a href="#orgafdaafb">CMake</a></li>
<li><a href="#orgd5763c5">Yasnippet</a></li>
<li><a href="#org61a7880">Flyspell</a></li>
<li><a href="#orgb5ec417">Evil nerd commenter</a></li>
<li><a href="#org9a86625">Tree Sitter Highlighting</a></li>
</ul>
</li>
<li><a href="#org6fa2a73">Languages</a>
<ul>
<li><a href="#org75248f6">Emacs-lisp</a></li>
<li><a href="#org32b3d66">Bash</a></li>
<li><a href="#org713a63b">Python</a></li>
<li><a href="#org9dd0762">C/C++</a></li>
</ul>
</li>
<li><a href="#org657abda">Org-Mode</a>
<ul>
<li><a href="#org4feafc8">Mode setup</a></li>
<li><a href="#org54ebb72">Fonts</a></li>
<li><a href="#org5dacab6">Start</a></li>
<li><a href="#org5a100ca">Bullets</a></li>
<li><a href="#org12d3926">Center column</a></li>
<li><a href="#org418cd75">Org-babel</a></li>
<li><a href="#org02394e6">Inline latex</a></li>
<li><a href="#orgd49960a">Keybindings</a></li>
<li><a href="#orgd345286">HTML</a></li>
</ul>
</li>
<li><a href="#org8497910">Agenda/GTD</a>
<ul>
<li><a href="#org95acf82">General</a></li>
<li><a href="#org93b48e7">Habits</a></li>
<li><a href="#orga01ce55">Capture Templates</a></li>
<li><a href="#orgb3de694">Archive</a></li>
<li><a href="#org95217d9">Process Inbox Item</a></li>
<li><a href="#orgfe88532">Advice</a></li>
</ul>
</li>
<li><a href="#org7be3bb9">Terminals</a>
<ul>
<li><a href="#org342ac24">vterm</a></li>
<li><a href="#org61769e1">term-mode</a></li>
</ul>
</li>
<li><a href="#orgb9298ac">Theme</a>
<ul>
<li><a href="#org60b73bb">Setup and helpers</a></li>
<li><a href="#org93caef9">Themes</a></li>
<li><a href="#org4d4b6bf">Default and time switches</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgd829c43" class="outline-2">
<h2 id="orgd829c43">Setup</h2>
<div class="outline-text-2" id="text-orgd829c43">
</div>
<div id="outline-container-orgb320b31" class="outline-3">
<h3 id="orgb320b31">Auto-tangle</h3>
<div class="outline-text-3" id="text-orgb320b31">
<p>
This snippet adds a hook to <code>org-mode</code> buffers so that <code>efs/org-babel-tangle-config</code> gets executed each time such a buffer gets saved.  This function checks to see if the file being saved is the Emacs.org file you're looking at right now, and if so, automatically exports the configuration here to the associated output files.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">;; </span><span style="color: #98be65;">Automatically tangle our Emacs.org config file when we save it</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">efs/org-babel-tangle-config</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">when</span> <span style="color: #8ec07c;">(</span>string-equal <span style="color: #d65d0e;">(</span>buffer-file-name<span style="color: #d65d0e;">)</span>
                      <span style="color: #d65d0e;">(</span>expand-file-name <span style="color: #cdbe70;">"~/Dropbox/.dotfiles/emacs.org"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #98be65;">;; </span><span style="color: #98be65;">Dynamic scoping to the rescue</span>
    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">let</span> <span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span>org-confirm-babel-evaluate nil<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
      <span style="color: #d65d0e;">(</span>org-babel-tangle<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>add-hook 'org-mode-hook <span style="color: #b16286;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #8ec07c;">()</span> <span style="color: #8ec07c;">(</span>add-hook 'after-save-hook #'efs/org-babel-tangle-config<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09d2146" class="outline-3">
<h3 id="org09d2146">Use-package</h3>
<div class="outline-text-3" id="text-org09d2146">
<p>
Use-package is like a package manager. <a href="https://github.com/jwiegley/use-package">Use-Package Documentation</a>
Package archives: Elpa is default, Melpa is community.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">;; </span><span style="color: #98be65;">Initialize package sources</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">package</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> package-archives '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"melpa"</span> . <span style="color: #cdbe70;">"https://melpa.org/packages/"</span><span style="color: #8ec07c;">)</span>
                         <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"org"</span> . <span style="color: #cdbe70;">"https://orgmode.org/elpa/"</span><span style="color: #8ec07c;">)</span>
                         <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"elpa"</span> . <span style="color: #cdbe70;">"https://elpa.gnu.org/packages/"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>package-initialize<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">unless</span> package-archive-contents
  <span style="color: #b16286;">(</span>package-refresh-contents<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">Initialize use-package on non-Linux platforms</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">unless</span> <span style="color: #b16286;">(</span>package-installed-p 'use-package<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>package-install 'use-package<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">use-package</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> use-package-always-ensure t<span style="color: #458588;">)</span> <span style="color: #98be65;">; </span><span style="color: #98be65;">no need for :ensure t for each package.</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> use-package-verbose t<span style="color: #458588;">)</span> <span style="color: #98be65;">; </span><span style="color: #98be65;">log configure/loading messages in *Messages*</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">use-package-ensure-system-package</span>
<span style="color: #cd8500;">:ensure</span> t<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org003a0f0" class="outline-3">
<h3 id="org003a0f0">Automatic Package Updates</h3>
<div class="outline-text-3" id="text-org003a0f0">
<p>
The auto-package-update package helps us keep Emacs packages up to date.  It will prompt you after a certain number of days either at startup or at a specific time of day to remind you to update your packages.
</p>

<p>
You can also use <code>M-x auto-package-update-now</code> to update right now!
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">auto-package-update</span>
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>auto-package-update-interval 30<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>auto-package-update-prompt-before-update t<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> auto-package-update-delete-old-versions t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> auto-package-update-hide-results t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>auto-package-update-maybe<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>auto-package-update-at-time <span style="color: #cdbe70;">"09:00"</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgccb6c28" class="outline-2">
<h2 id="orgccb6c28">General Emacs</h2>
<div class="outline-text-2" id="text-orgccb6c28">
</div>
<div id="outline-container-org7bb2e25" class="outline-3">
<h3 id="org7bb2e25">UI Configurations</h3>
<div class="outline-text-3" id="text-org7bb2e25">
</div>
