emacs.org
*** Basic
#+begin_src emacs-lisp
  (setq inhibit-startup-message t)           ; inhibit startup message
  (tool-bar-mode -1)                         ; remove toolbar
  (menu-bar-mode -1)                         ; Disable the menu bar
  (scroll-bar-mode -1)                       ; remove side scrollbar
  (tooltip-mode -1)                          ; Disable tooltips
  (set-fringe-mode 10)                       ; Give some breathing room
  (setq visible-bell t)                      ; Set up the visible bell
  (save-place-mode 1)                        ; Open file where last visited
  (add-hook 'text-mode-hook 'flyspell-mode)  ; enable spellcheck on text mode
  (setq Buffer-menu-name-width 35)           ; give name more room
  ;; (add-hook 'prog-mode-hook 'hl-line-mode)   ; highlight lines when programming

  ;; The following helps syncing
  (global-auto-revert-mode 1)                ; refresh buffer if changed on disk
  (setq auto-revert-use-notify nil)          ; don't notify?
  (setq auto-revert-verbose nil)             ;

  ;; Open text files in Org-Mode
  ;; (add-to-list 'auto-mode-alist '("\\.text\\'" . org-mode))
  ;; (add-to-list 'auto-mode-alist '("\\.txt\\'" . org-mode))
#+end_src

*** Scrolling
#+begin_src emacs-lisp
    (use-package emacs
      :custom
      ;; Fully redraw the display before it processes queued input events.
      (redisplay-dont-pause            t)

      ;; Number of lines of continuity to retain when scrolling by full screens
      ;; (next-screen-context-lines       2)  ;; golden ration pkg replaced this

      ;; only 'jump' when moving this far off the screen
      (scroll-conservatively       10000)
      (scroll-step                     1) ;; Keyboard scroll one line at a time
      (mouse-wheel-progressive-speed nil) ;; Don't accelerate scrolling
      (mouse-wheel-follow-mouse        t) ;; Scroll window under mouse
      (fast-but-imprecise-scrolling    t) ;; No (less) lag while scrolling lots.
      (auto-window-vscroll           nil) ;; Cursor move faster
      (pixel-scroll-precision-mode     1) ;; pixel based scrolling
      )
#+end_src

**** Fast Scroll
To ensure scrolling is fast in Emacs, disable  non-essential things while the window is being scrolled:
#+begin_src emacs-lisp
(use-package fast-scroll
  :ensure t
  :demand t
  :config
  (add-hook 'fast-scroll-start-hook (lambda () (flycheck-mode -1)))
  (add-hook 'fast-scroll-end-hook (lambda () (flycheck-mode 1)))
  (fast-scroll-config)
  (fast-scroll-mode 1))
#+end_src

*** Undo-tree
    - =C-x u= visualizes undo history as a tree for easy navigation
    - =C-_= undo
    - =M-_= redo
#+begin_src emacs-lisp
  (use-package undo-tree
    :config
    (global-undo-tree-mode 1)
    (setq undo-tree-auto-save-history nil) ;; don't save ~undo-tree~ file
    )
#+end_src

*** Backup files
Save backups in =.emacs.d=.
#+begin_src emacs-lisp
  (setq backup-directory-alist
        '( ("." . "~/.dotfiles/.emacs.d/filebackups")))
#+end_src

*** Modeline
*NOTE*: The first time you load your configuration on a new machine, you’ll need to run =M-x all-the-icons-install-fonts= so that mode line icons display correctly. (Fixed?)
#+begin_src emacs-lisp  
  (use-package all-the-icons
  :init
  (when (and (not (member "all-the-icons" (font-family-list))) ;; autoinstall fonts
             (window-system))
    (all-the-icons-install-fonts t)))

  (use-package doom-modeline
    :init (doom-modeline-mode 1)
    :custom ((doom-modeline-height 15)))
#+end_src

