emacs.html
<div id="outline-container-orga0c1bb1" class="outline-4">
<h4 id="orga0c1bb1">Basic</h4>
<div class="outline-text-4" id="text-orga0c1bb1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> inhibit-startup-message t<span style="color: #458588;">)</span>           <span style="color: #98be65;">; </span><span style="color: #98be65;">inhibit startup message</span>
<span style="color: #458588;">(</span>tool-bar-mode -1<span style="color: #458588;">)</span>                         <span style="color: #98be65;">; </span><span style="color: #98be65;">remove toolbar</span>
<span style="color: #458588;">(</span>menu-bar-mode -1<span style="color: #458588;">)</span>                         <span style="color: #98be65;">; </span><span style="color: #98be65;">Disable the menu bar</span>
<span style="color: #458588;">(</span>scroll-bar-mode -1<span style="color: #458588;">)</span>                       <span style="color: #98be65;">; </span><span style="color: #98be65;">remove side scrollbar</span>
<span style="color: #458588;">(</span>tooltip-mode -1<span style="color: #458588;">)</span>                          <span style="color: #98be65;">; </span><span style="color: #98be65;">Disable tooltips</span>
<span style="color: #458588;">(</span>set-fringe-mode 10<span style="color: #458588;">)</span>                       <span style="color: #98be65;">; </span><span style="color: #98be65;">Give some breathing room</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> visible-bell t<span style="color: #458588;">)</span>                      <span style="color: #98be65;">; </span><span style="color: #98be65;">Set up the visible bell</span>
<span style="color: #458588;">(</span>save-place-mode 1<span style="color: #458588;">)</span>                        <span style="color: #98be65;">; </span><span style="color: #98be65;">Open file where last visited</span>
<span style="color: #458588;">(</span>add-hook 'text-mode-hook 'flyspell-mode<span style="color: #458588;">)</span>  <span style="color: #98be65;">; </span><span style="color: #98be65;">enable spellcheck on text mode</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> Buffer-menu-name-width 35<span style="color: #458588;">)</span>           <span style="color: #98be65;">; </span><span style="color: #98be65;">give name more room</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(add-hook 'prog-mode-hook 'hl-line-mode)   ; highlight lines when programming</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">The following helps syncing</span>
<span style="color: #458588;">(</span>global-auto-revert-mode 1<span style="color: #458588;">)</span>                <span style="color: #98be65;">; </span><span style="color: #98be65;">refresh buffer if changed on disk</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> auto-revert-use-notify nil<span style="color: #458588;">)</span>          <span style="color: #98be65;">; </span><span style="color: #98be65;">don't notify?</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> auto-revert-verbose nil<span style="color: #458588;">)</span>             <span style="color: #98be65;">;</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">Open text files in Org-Mode</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(add-to-list 'auto-mode-alist '("\\.text\\'" . org-mode))</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(add-to-list 'auto-mode-alist '("\\.txt\\'" . org-mode))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a61ba1" class="outline-4">
<h4 id="org6a61ba1">Scrolling</h4>
<div class="outline-text-4" id="text-org6a61ba1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">emacs</span>
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Fully redraw the display before it processes queued input events.</span>
  <span style="color: #b16286;">(</span>redisplay-dont-pause            t<span style="color: #b16286;">)</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Number of lines of continuity to retain when scrolling by full screens</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(next-screen-context-lines       2)  ;; golden ration pkg replaced this</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">only '</span><span style="color: #d3869b;">jump</span><span style="color: #98be65;">' when moving this far off the screen</span>
  <span style="color: #b16286;">(</span>scroll-conservatively       10000<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>scroll-step                     1<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">Keyboard scroll one line at a time</span>
  <span style="color: #b16286;">(</span>mouse-wheel-progressive-speed nil<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">Don't accelerate scrolling</span>
  <span style="color: #b16286;">(</span>mouse-wheel-follow-mouse        t<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">Scroll window under mouse</span>
  <span style="color: #b16286;">(</span>fast-but-imprecise-scrolling    t<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">No (less) lag while scrolling lots.</span>
  <span style="color: #b16286;">(</span>auto-window-vscroll           nil<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">Cursor move faster</span>
  <span style="color: #b16286;">(</span>pixel-scroll-precision-mode     1<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">pixel based scrolling</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>

<ul class="org-ul">
<li><a id="orgec763af"></a>Fast Scroll<br />
<div class="outline-text-5" id="text-orgec763af">
<p>
To ensure scrolling is fast in Emacs, disable  non-essential things while the window is being scrolled:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">fast-scroll</span>
  <span style="color: #cd8500;">:ensure</span> t
  <span style="color: #cd8500;">:demand</span> t
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>add-hook 'fast-scroll-start-hook <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #d65d0e;">()</span> <span style="color: #d65d0e;">(</span>flycheck-mode -1<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-hook 'fast-scroll-end-hook <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #d65d0e;">()</span> <span style="color: #d65d0e;">(</span>flycheck-mode 1<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>fast-scroll-config<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>fast-scroll-mode 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org488599a" class="outline-4">
<h4 id="org488599a">Undo-tree</h4>
<div class="outline-text-4" id="text-org488599a">
<ul class="org-ul">
<li><code>C-x u</code> visualizes undo history as a tree for easy navigation</li>
<li><code>C-_</code> undo</li>
<li><code>M-_</code> redo</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">undo-tree</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>global-undo-tree-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> undo-tree-auto-save-history nil<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">don't save ~undo-tree~ file</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org617f40b" class="outline-4">
<h4 id="org617f40b">Backup files</h4>
<div class="outline-text-4" id="text-org617f40b">
<p>
Save backups in <code>.emacs.d</code>.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> backup-directory-alist
      '<span style="color: #b16286;">(</span> <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"."</span> . <span style="color: #cdbe70;">"~/.dotfiles/.emacs.d/filebackups"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org44db4c1" class="outline-4">
<h4 id="org44db4c1">Modeline</h4>
<div class="outline-text-4" id="text-org44db4c1">
<p>
<b>NOTE</b>: The first time you load your configuration on a new machine, you’ll need to run <code>M-x all-the-icons-install-fonts</code> so that mode line icons display correctly. (Fixed?)
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">all-the-icons</span>
<span style="color: #cd8500;">:init</span>
<span style="color: #b16286;">(</span><span style="color: #fb4933;">when</span> <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">and</span> <span style="color: #d65d0e;">(</span>not <span style="color: #458588;">(</span>member <span style="color: #cdbe70;">"all-the-icons"</span> <span style="color: #b16286;">(</span>font-family-list<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">autoinstall fonts</span>
           <span style="color: #d65d0e;">(</span>window-system<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
  <span style="color: #8ec07c;">(</span>all-the-icons-install-fonts t<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">doom-modeline</span>
  <span style="color: #cd8500;">:init</span> <span style="color: #b16286;">(</span>doom-modeline-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:custom</span> <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>doom-modeline-height 15<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
