emacs.org
*** Transparency
#+begin_src emacs-lisp
  (defun transparency (value)
    "Sets the transparency of the frame window. 0=transparent/100=opaque"
    (interactive "nTransparency Value 0 - 100 opaque:")
    (if (version<= "29" emacs-version)
        (set-frame-parameter nil 'alpha-background value)
      (set-frame-parameter (selected-frame) 'alpha value)))
#+end_src

*** Auto-clean white space
#+begin_src emacs-lisp
  (use-package ws-butler
    :defer t
    :hook ((text-mode . ws-butler-mode)
           (prog-mode . ws-butler-mode)))
#+end_src

*** Make  =yes or no= prompts shorter
#+begin_src emacs-lisp
(defalias 'yes-or-no-p 'y-or-n-p)
#+end_src

*** Recentf
Recentf is needed for recent files on the dashboard.
#+begin_src emacs-lisp
(recentf-mode 1) ;; needed for recent files in dashboard
(add-to-list 'recentf-exclude "~/Dropbox/.dotfiles/emacs.html")
(add-to-list 'recentf-exclude "~/Documents/gtd/next.org")
(add-to-list 'recentf-exclude "~/Documents/gtd/whip.org")
(add-to-list 'recentf-exclude "~/Documents/gtd/someday.org")
(add-to-list 'recentf-exclude "~/Documents/gtd/inbox.org")
(add-to-list 'recentf-exclude "~/Documents/gtd/projects.org")
#+end_src

*** Dashboard
Dash board for initial startup of emacs. [[https://github.com/emacs-dashboard/emacs-dashboard][github link]]
- For the icons to display correctly, I needed  to execute =all-of-the-icons-install-fonts=.

#+begin_src emacs-lisp
  (use-package dashboard
    :ensure t
    :init     (dashboard-setup-startup-hook)
    :bind ( "C-c d" . dashboard-open)
    :config
    (setq dashboard-startup-banner 1)
    (setq dashboard-center-content 1)
    (setq dashboard-show-shortcuts nil)
    (setq dashboard-items '((recents  . 12)
                            ;; (bookmarks . 5)
                            (projects . 4)
                            (agenda . 5)
                            ;; (registers . 5)
                            ))
    (setq dashboard-set-heading-icons t)
    (setq dashboard-set-file-icons t)
    (setq dashboard-projects-backend 'project-el)
    (dashboard-modify-heading-icons '((recents . "file-text")))
    (setq dashboard-set-footer nil))

  (defun my-dashboard-hook()
    "Needed to define these after hook for some reason"
    (define-key dashboard-mode-map (kbd "n")  'dashboard-next-line)
    (define-key dashboard-mode-map (kbd "p")  'dashboard-previous-line)
    (define-key dashboard-mode-map (kbd "j")  'dashboard-jump-to-projects))

  (add-hook 'dashboard-mode-hook 'my-dashboard-hook)
#+end_src

