emacs.html

<div id="outline-container-org0aadf20" class="outline-4">
<h4 id="org0aadf20">Transparency</h4>
<div class="outline-text-4" id="text-org0aadf20">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">transparency</span> <span style="color: #b16286;">(</span>value<span style="color: #b16286;">)</span>
  <span style="color: #cdbe70;">"Sets the transparency of the frame window. 0=transparent/100=opaque"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span> <span style="color: #cdbe70;">"nTransparency Value 0 - 100 opaque:"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">if</span> <span style="color: #8ec07c;">(</span>version&lt;= <span style="color: #cdbe70;">"29"</span> emacs-version<span style="color: #8ec07c;">)</span>
      <span style="color: #8ec07c;">(</span>set-frame-parameter nil 'alpha-background value<span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>set-frame-parameter <span style="color: #d65d0e;">(</span>selected-frame<span style="color: #d65d0e;">)</span> 'alpha value<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd237fa" class="outline-4">
<h4 id="orgbd237fa">Auto-clean white space</h4>
<div class="outline-text-4" id="text-orgbd237fa">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ws-butler</span>
  <span style="color: #cd8500;">:defer</span> t
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>text-mode . ws-butler-mode<span style="color: #8ec07c;">)</span>
         <span style="color: #8ec07c;">(</span>prog-mode . ws-butler-mode<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge2ffa8b" class="outline-4">
<h4 id="orge2ffa8b">Make  <code>yes or no</code> prompts shorter</h4>
<div class="outline-text-4" id="text-orge2ffa8b">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defalias</span> '<span style="color: #fabd2f;">yes-or-no-p</span> 'y-or-n-p<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3ecfc0a" class="outline-4">
<h4 id="org3ecfc0a">Recentf</h4>
<div class="outline-text-4" id="text-org3ecfc0a">
<p>
Recentf is needed for recent files on the dashboard.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>recentf-mode 1<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">needed for recent files in dashboard</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Dropbox/.dotfiles/emacs.html"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Documents/gtd/next.org"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Documents/gtd/whip.org"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Documents/gtd/someday.org"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Documents/gtd/inbox.org"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'recentf-exclude <span style="color: #cdbe70;">"~/Documents/gtd/projects.org"</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org856d78e" class="outline-4">
<h4 id="org856d78e">Dashboard</h4>
<div class="outline-text-4" id="text-org856d78e">
<p>
Dash board for initial startup of emacs. <a href="https://github.com/emacs-dashboard/emacs-dashboard">github link</a>
</p>
<ul class="org-ul">
<li>For the icons to display correctly, I needed  to execute <code>all-of-the-icons-install-fonts</code>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dashboard</span>
  <span style="color: #cd8500;">:ensure</span> t
  <span style="color: #cd8500;">:init</span>     <span style="color: #b16286;">(</span>dashboard-setup-startup-hook<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span> <span style="color: #cdbe70;">"C-c d"</span> . dashboard-open<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-startup-banner 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-center-content 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-show-shortcuts nil<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-items '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>recents  . 12<span style="color: #d65d0e;">)</span>
                          <span style="color: #98be65;">;; </span><span style="color: #98be65;">(bookmarks . 5)</span>
                          <span style="color: #d65d0e;">(</span>projects . 4<span style="color: #d65d0e;">)</span>
                          <span style="color: #d65d0e;">(</span>agenda . 5<span style="color: #d65d0e;">)</span>
                          <span style="color: #98be65;">;; </span><span style="color: #98be65;">(registers . 5)</span>
                          <span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-set-heading-icons t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-set-file-icons t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-projects-backend 'project-el<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>dashboard-modify-heading-icons '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>recents . <span style="color: #cdbe70;">"file-text"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dashboard-set-footer nil<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-dashboard-hook</span><span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Needed to define these after hook for some reason"</span>
  <span style="color: #b16286;">(</span>define-key dashboard-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"n"</span><span style="color: #8ec07c;">)</span>  'dashboard-next-line<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>define-key dashboard-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"p"</span><span style="color: #8ec07c;">)</span>  'dashboard-previous-line<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>define-key dashboard-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"j"</span><span style="color: #8ec07c;">)</span>  'dashboard-jump-to-projects<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>add-hook 'dashboard-mode-hook 'my-dashboard-hook<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
