emacs.org
** Dired
More to do at [[https://youtu.be/PMWwM8QJAtU][here]]: dired-open
- "W" will open file in native environment (including another Emacs)
- "(" toggle file info
- M-x du  shows the size of the files in the buffer (toggle for human readable)
#+begin_src emacs-lisp
  (use-package dired
    :ensure nil
    :commands dired
    ;; :hook (dired-mode . dired-hide-details-mode) ;; '(' to toggle details
    :config
    (setq dired-listing-switches "-agho --group-directories-first" )
    (setq find-ls-option '("-print0 | xargs -0 ls -agho" . ""))
    (setq dired-dwim-target t) ;; guess other dired directory for copy and rename
    (setq wdired-allow-to-change-permissions t)
    (define-key dired-mode-map (kbd "C-o") 'other-window)
    (setq dired-guess-shell-alist-user '(("\\.png\\'" "shotwell")
                                         ("\\.jpeg\\'" "shotwell")
                                         ("\\.mp4\\'" "vlc")
                                         ("\\.avi\\'" "vlc")
                                         ("\\.iso\\'" "vlc")
                                         ("\\.mp3\\'" "rhythmbox")
                                         ("\\.html\\'" "firefox")
                                         ("\\.epub\\'" "ebook-viewer")
                                         ("\\.pdf\\'" "evince")
                                         ("\\.ipynb\\'" "code"))))

  ;; nice icons in dired
  (use-package treemacs-icons-dired
    :after dired
    :defer t
    :config (treemacs-icons-dired-mode) )

  ;; janky mode which lists the recursive size of each foler/item in dired.
  (use-package dired-du
    :commands dired-du-mode
    :defer t
    :config (setq dired-du-size-format t))

  ;; use a single dired session
  (use-package dired-single)

  (defun my-dired-init ()
    "Bunch of stuff to run for dired, either immediately or when it's
            loaded."
    (define-key dired-mode-map [remap dired-find-file]
                'dired-single-buffer)
    (define-key dired-mode-map [remap dired-mouse-find-file-other-window]
                'dired-single-buffer-mouse)
    (define-key dired-mode-map [remap dired-up-directory]
                'dired-single-up-directory))

  ;; if dired's already loaded, then the keymap will be bound
  (if (boundp 'dired-mode-map)
      ;; we're good to go; just add our bindings
      (my-dired-init)
    ;; it's not loaded yet, so add our bindings to the load-hook
    (add-hook 'dired-load-hook 'my-dired-init))

#+end_src

** Proced
#+begin_src emacs-lisp
  (defun proced-settings ()
      (proced-toggle-auto-update 5)) ;; auto update every 4 seconds

  (add-hook 'proced-mode-hook 'proced-settings)
#+end_src

** Native Compilation
*** Suppress compilation warnings
#+begin_src emacs-lisp
  (setq native-comp-async-report-warnings-errors nil)
#+end_src

** Goto last change
Check with other environments to settle on "C-;" or "M-;" -- the other us used for =evil-nerd comment=
- we cleared "C-;" from Flyspell above
#+begin_src emacs-lisp
  (use-package goto-last-change
    :ensure t
    :bind ("C-;" . goto-last-change))
#+end_src

** Input Buffer, Directory Search
*** Ivy, Ivy-Rich, and Counsel
Ivy displays vertical completions of input buffer.
#+begin_src emacs-lisp
  (use-package ivy
    :delight ivy-mode
    :config
    (ivy-mode 1)
    ;; remove ^ on the inputbuffer
    (setq ivy-initial-inputs-alist nil))
#+end_src

*** Ivy-Rich
Ivy-rich provides information to display in input buffer to counsel.
#+begin_src emacs-lisp
  (use-package ivy-rich
    :after ivy
    :init  
    (ivy-rich-mode 1))
#+end_src

