emacs.html

<div id="outline-container-org25e80ba" class="outline-3">
<h3 id="org25e80ba">Dired</h3>
<div class="outline-text-3" id="text-org25e80ba">
<p>
More to do at <a href="https://youtu.be/PMWwM8QJAtU">here</a>: dired-open
</p>
<ul class="org-ul">
<li>"W" will open file in native environment (including another Emacs)</li>
<li>"(" toggle file info</li>
<li>M-x du  shows the size of the files in the buffer (toggle for human readable)</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired</span>
  <span style="color: #cd8500;">:ensure</span> nil
  <span style="color: #cd8500;">:commands</span> dired
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">:hook (dired-mode . dired-hide-details-mode) ;; '(' to toggle details</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dired-listing-switches <span style="color: #cdbe70;">"-agho --group-directories-first"</span> <span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> find-ls-option '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"-print0 | xargs -0 ls -agho"</span> . <span style="color: #cdbe70;">""</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dired-dwim-target t<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">guess other dired directory for copy and rename</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> wdired-allow-to-change-permissions t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>define-key dired-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #8ec07c;">)</span> 'other-window<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dired-guess-shell-alist-user '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.png\\'"</span> <span style="color: #cdbe70;">"shotwell"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.jpeg\\'"</span> <span style="color: #cdbe70;">"shotwell"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.mp4\\'"</span> <span style="color: #cdbe70;">"vlc"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.avi\\'"</span> <span style="color: #cdbe70;">"vlc"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.iso\\'"</span> <span style="color: #cdbe70;">"vlc"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.mp3\\'"</span> <span style="color: #cdbe70;">"rhythmbox"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.html\\'"</span> <span style="color: #cdbe70;">"firefox"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.epub\\'"</span> <span style="color: #cdbe70;">"ebook-viewer"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.pdf\\'"</span> <span style="color: #cdbe70;">"evince"</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"\\.ipynb\\'"</span> <span style="color: #cdbe70;">"code"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">nice icons in dired</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">treemacs-icons-dired</span>
  <span style="color: #cd8500;">:after</span> dired
  <span style="color: #cd8500;">:defer</span> t
  <span style="color: #cd8500;">:config</span> <span style="color: #b16286;">(</span>treemacs-icons-dired-mode<span style="color: #b16286;">)</span> <span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">janky mode which lists the recursive size of each foler/item in dired.</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired-du</span>
  <span style="color: #cd8500;">:commands</span> dired-du-mode
  <span style="color: #cd8500;">:defer</span> t
  <span style="color: #cd8500;">:config</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> dired-du-size-format t<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">use a single dired session</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dired-single</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-dired-init</span> <span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Bunch of stuff to run for dired, either immediately or when it's</span>
<span style="color: #cdbe70;">          loaded."</span>
  <span style="color: #b16286;">(</span>define-key dired-mode-map <span style="color: #8ec07c;">[</span>remap dired-find-file<span style="color: #8ec07c;">]</span>
              'dired-single-buffer<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>define-key dired-mode-map <span style="color: #8ec07c;">[</span>remap dired-mouse-find-file-other-window<span style="color: #8ec07c;">]</span>
              'dired-single-buffer-mouse<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>define-key dired-mode-map <span style="color: #8ec07c;">[</span>remap dired-up-directory<span style="color: #8ec07c;">]</span>
              'dired-single-up-directory<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">if dired's already loaded, then the keymap will be bound</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">if</span> <span style="color: #b16286;">(</span>boundp 'dired-mode-map<span style="color: #b16286;">)</span>
    <span style="color: #98be65;">;; </span><span style="color: #98be65;">we're good to go; just add our bindings</span>
    <span style="color: #b16286;">(</span>my-dired-init<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">it's not loaded yet, so add our bindings to the load-hook</span>
  <span style="color: #b16286;">(</span>add-hook 'dired-load-hook 'my-dired-init<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org08b75f0" class="outline-3">
<h3 id="org08b75f0">Proced</h3>
<div class="outline-text-3" id="text-org08b75f0">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">proced-settings</span> <span style="color: #b16286;">()</span>
    <span style="color: #b16286;">(</span>proced-toggle-auto-update 5<span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">auto update every 4 seconds</span>

<span style="color: #458588;">(</span>add-hook 'proced-mode-hook 'proced-settings<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org998669f" class="outline-3">
<h3 id="org998669f">Native Compilation</h3>
<div class="outline-text-3" id="text-org998669f">
</div>
<div id="outline-container-org5304a72" class="outline-4">
<h4 id="org5304a72">Suppress compilation warnings</h4>
<div class="outline-text-4" id="text-org5304a72">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> native-comp-async-report-warnings-errors nil<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc887ef2" class="outline-3">
<h3 id="orgc887ef2">Goto last change</h3>
<div class="outline-text-3" id="text-orgc887ef2">
<p>
Check with other environments to settle on "C-;" or "M-;" &#x2013; the other us used for <code>evil-nerd comment</code>
</p>
<ul class="org-ul">
<li>we cleared "C-;" from Flyspell above</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">goto-last-change</span>
  <span style="color: #cd8500;">:ensure</span> t
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #cdbe70;">"C-;"</span> . goto-last-change<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga24e01f" class="outline-3">
<h3 id="orga24e01f">Input Buffer, Directory Search</h3>
<div class="outline-text-3" id="text-orga24e01f">
</div>
<div id="outline-container-org02a4e1b" class="outline-4">
<h4 id="org02a4e1b">Ivy, Ivy-Rich, and Counsel</h4>
<div class="outline-text-4" id="text-org02a4e1b">
<p>
Ivy displays vertical completions of input buffer.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ivy</span>
  <span style="color: #cd8500;">:delight</span> ivy-mode
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>ivy-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">remove ^ on the inputbuffer</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> ivy-initial-inputs-alist nil<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf780c2f" class="outline-4">
<h4 id="orgf780c2f">Ivy-Rich</h4>
<div class="outline-text-4" id="text-orgf780c2f">
<p>
Ivy-rich provides information to display in input buffer to counsel.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ivy-rich</span>
  <span style="color: #cd8500;">:after</span> ivy
  <span style="color: #cd8500;">:init</span>  
  <span style="color: #b16286;">(</span>ivy-rich-mode 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
