emacs.org
*** Ivy-prescient
prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them. This can be especially helpful when using M-x to run commands that you don’t have bound to a key but still need to access occasionally.

#+begin_src emacs-lisp
  (use-package ivy-prescient
    :after counsel
    :custom
    (ivy-prescient-enable-filtering nil)
    :config
    ;; Uncomment the following line to have sorting remembered across sessions!
    (prescient-persist-mode 1)
    (ivy-prescient-mode 1))
#+end_src

*** Counsel
Counsel displays ivy-rich info along with suggestions in input buffer.
- =M-o= allows access to help in input buffer.

#+begin_src emacs-lisp
  (use-package counsel
    :bind (("M-x" . counsel-M-x)      ; displays ivy-rich info in minibuffer
           ("C-x C-f" . counsel-find-file)
           :map minibuffer-local-map
           ("C-r" . 'counsel-minibuffer-history)
           ))
#+end_src
*
** Helpful and Which-key
**** Helpful
Better version of help. We remap normal help keys to Helpful's versions.
#+begin_src emacs-lisp
  (use-package helpful
  :commands (helpful-callable helpful-variavle helpful-command helpful-key)
    :custom
    (counsel-describe-function-function #'helpful-callable)
    (counsel-describe-variable-function #'helpful-variable)
    :bind
    ([remap describe-function] . counsel-describe-function)
    ([remap describe-command] . helpful-command)
    ([remap describe-variable] . counsel-describe-variable)
    ([remap describe-key] . helpful-key))
#+end_src

**** Which-key
#+begin_src emacs-lisp
  (use-package which-key
    :defer 0
    :delight which-key-mode  
    :config(which-key-mode)
    (setq which-key-idle-delay 0.8))
#+end_src

*** Grammarly (not set up)                                       :noexport:
There looks to be several packages at the moment. Top two (as of 1/10/22) are installed here without proper hooks. 
**** lsp-grammarly
Gives warning on startup for login.   [[https://github.com/emacs-grammarly/lsp-grammarly][lsp-grammarly doc]]
#+begin_src emacs-lisp  :tangle no
  (use-package lsp-grammarly
  :ensure t
  :hook (text-mode . (lambda ()
                       (require 'lsp-grammarly)
                       (lsp))))
#+end_src

**** flycheck-grammarly
Works w/o being logged in.                         [[https://github.com/emacs-grammarly/flycheck-grammarly][flycheck-grammarly doc]]
#+begin_src emacs-lisp  :tangle no
  (use-package flycheck-grammarly
  :config
  (setq flycheck-grammarly-check-time 0.8))
#+end_src

