emacs.html

<div id="outline-container-org3edc19b" class="outline-4">
<h4 id="org3edc19b">Ivy-prescient</h4>
<div class="outline-text-4" id="text-org3edc19b">
<p>
prescient.el provides some helpful behavior for sorting Ivy completion candidates based on how recently or frequently you select them. This can be especially helpful when using M-x to run commands that you don’t have bound to a key but still need to access occasionally.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ivy-prescient</span>
  <span style="color: #cd8500;">:after</span> counsel
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>ivy-prescient-enable-filtering nil<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Uncomment the following line to have sorting remembered across sessions!</span>
  <span style="color: #b16286;">(</span>prescient-persist-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>ivy-prescient-mode 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba2b00e" class="outline-4">
<h4 id="orgba2b00e">Counsel</h4>
<div class="outline-text-4" id="text-orgba2b00e">
<p>
Counsel displays ivy-rich info along with suggestions in input buffer.
</p>
<ul class="org-ul">
<li><code>M-o</code> allows access to help in input buffer.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">counsel</span>
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"M-x"</span> . counsel-M-x<span style="color: #8ec07c;">)</span>      <span style="color: #98be65;">; </span><span style="color: #98be65;">displays ivy-rich info in minibuffer</span>
         <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"C-x C-f"</span> . counsel-find-file<span style="color: #8ec07c;">)</span>
         <span style="color: #cd8500;">:map</span> minibuffer-local-map
         <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"C-r"</span> . 'counsel-minibuffer-history<span style="color: #8ec07c;">)</span>
         <span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
<p>
*
</p>
</div>
</div>
</div>
<div id="outline-container-org1177e73" class="outline-3">
<h3 id="org1177e73">Helpful and Which-key</h3>
<div class="outline-text-3" id="text-org1177e73">
</div>
<ul class="org-ul">
<li><a id="org23a81a2"></a>Helpful<br />
<div class="outline-text-5" id="text-org23a81a2">
<p>
Better version of help. We remap normal help keys to Helpful's versions.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">helpful</span>
<span style="color: #cd8500;">:commands</span> <span style="color: #b16286;">(</span>helpful-callable helpful-variavle helpful-command helpful-key<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>counsel-describe-function-function #'helpful-callable<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>counsel-describe-variable-function #'helpful-variable<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:bind</span>
  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">[</span>remap describe-function<span style="color: #8ec07c;">]</span> . counsel-describe-function<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">[</span>remap describe-command<span style="color: #8ec07c;">]</span> . helpful-command<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">[</span>remap describe-variable<span style="color: #8ec07c;">]</span> . counsel-describe-variable<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">[</span>remap describe-key<span style="color: #8ec07c;">]</span> . helpful-key<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgddcdf40"></a>Which-key<br />
<div class="outline-text-5" id="text-orgddcdf40">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">which-key</span>
  <span style="color: #cd8500;">:defer</span> 0
  <span style="color: #cd8500;">:delight</span> which-key-mode  
  <span style="color: #cd8500;">:config</span><span style="color: #b16286;">(</span>which-key-mode<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> which-key-idle-delay 0.8<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>
</ul>
