emacs.org
*** Keybindings
#+begin_src emacs-lisp
   ;; general improvements
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
   (global-set-key (kbd "C-x C-b") 'buffer-menu)   ;; open buffer menue in current buffer
   (global-set-key (kbd "C-x C-k") 'kill-current-buffer)   ;; "C-x k" asks which buffer
   (global-set-key (kbd "C-o") 'other-window)  ;; default is "C-x o"
   (global-set-key (kbd "M-o") 'previous-multiframe-window)
   (global-set-key (kbd "C-c C-c") 'eval-buffer)
   (global-set-key (kbd "C-c C-r") 'eval-region)

   ;; Make font bigger/smaller.
   (global-set-key (kbd "C-=") 'text-scale-increase)
   (global-set-key (kbd "C--") 'text-scale-decrease)
   (global-set-key (kbd "C-0") 'text-scale-adjust)

   ;; Org notes flow
   (global-set-key (kbd "<f5>") 'org-store-link)
   (global-set-key (kbd "<f6>") 'org-insert-link)
  ;; (global-set-key (kbd "<f7>") 'org-agenda ;; set later!
  (global-set-key (kbd "<f8>") 'org-html-export-to-html)

   ;; writing/editing
   (global-set-key (kbd "<f9>") 'ispell-word)
   (global-set-key (kbd "<f10>") 'dictionary-lookup-definition)

   ;; Buffer-menu-mode
   (define-key Buffer-menu-mode-map (kbd "C-o") 'other-window)
   (define-key Buffer-menu-mode-map (kbd "M-o") 'previous-multiframe-window)
   ;; "o" opens in another buffer and moves focus
   ;; "C-M-o" opens in another buffer and keeps focus in the Buffer-menu
   (define-key Buffer-menu-mode-map (kbd "C-M-o") 'Buffer-menu-switch-other-window)

   ;; compilation-mode
   (define-key compilation-mode-map (kbd "C-o") 'other-window)

   ;; grep-mode
   (defun jmn-grep-keybindings()
     (define-key grep-mode-map (kbd "o") 'compilation-display-error)
     (define-key grep-mode-map (kbd "C-o") 'other-window))

   (add-hook 'grep-mode-hook #'jmn-grep-keybindings)
#+end_src

*Possible TODO:* create my own keybindings as shown [[https://www.youtube.com/watch?v=xaZMwNELaJY][here]]. hydra ties related commands into short bindings with a common prefix.

*** Font size
#+begin_src emacs-lisp
  (set-face-attribute
   'default nil
   :height (assoc-default (system-name) '(("xps" . 115)
                                          ("dsk" . 120))))

  (setq text-scale-mode-step 1.05)
#+end_src

*** General Helper Function
**** jmn-load-init
#+begin_src emacs-lisp
  (defun jmn-load-init ()
    (interactive)
    (load "~/.emacs.d/init.el"))
#+end_src

**** jmn-vscode-current-buffer-file-at-point
#+begin_src emacs-lisp
  (defun jmn/vscode-current-buffer-file-at-point ()
    (interactive)
    (start-process-shell-command "code"
                                 nil
                                 (concat "code --goto "
                                         (buffer-file-name)
                                         ":"
                                         (number-to-string (line-number-at-pos))
                                         ":"
                                         ;; +1 who knows why
                                         (number-to-string (+ 1 (current-column))))))

  (define-key global-map (kbd "<f12>")
              'jmn-vscode-current-buffer-file-at-point)
#+end_src

* General Development
