emacs.html

<div id="outline-container-org192913e" class="outline-4">
<h4 id="org192913e">Keybindings</h4>
<div class="outline-text-4" id="text-org192913e">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #98be65;">;; </span><span style="color: #98be65;">general improvements</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;escape&gt;"</span><span style="color: #b16286;">)</span> 'keyboard-escape-quit<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-x C-b"</span><span style="color: #b16286;">)</span> 'buffer-menu<span style="color: #458588;">)</span>   <span style="color: #98be65;">;; </span><span style="color: #98be65;">open buffer menue in current buffer</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-x C-k"</span><span style="color: #b16286;">)</span> 'kill-current-buffer<span style="color: #458588;">)</span>   <span style="color: #98be65;">;; </span><span style="color: #98be65;">"C-x k" asks which buffer</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #b16286;">)</span> 'other-window<span style="color: #458588;">)</span>  <span style="color: #98be65;">;; </span><span style="color: #98be65;">default is "C-x o"</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"M-o"</span><span style="color: #b16286;">)</span> 'previous-multiframe-window<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c C-c"</span><span style="color: #b16286;">)</span> 'eval-buffer<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c C-r"</span><span style="color: #b16286;">)</span> 'eval-region<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">Make font bigger/smaller.</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-="</span><span style="color: #b16286;">)</span> 'text-scale-increase<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C--"</span><span style="color: #b16286;">)</span> 'text-scale-decrease<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-0"</span><span style="color: #b16286;">)</span> 'text-scale-adjust<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">Org notes flow</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f5&gt;"</span><span style="color: #b16286;">)</span> 'org-store-link<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f6&gt;"</span><span style="color: #b16286;">)</span> 'org-insert-link<span style="color: #458588;">)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(global-set-key (kbd "&lt;f7&gt;") 'org-agenda ;; set later!</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f8&gt;"</span><span style="color: #b16286;">)</span> 'org-html-export-to-html<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">writing/editing</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f9&gt;"</span><span style="color: #b16286;">)</span> 'ispell-word<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f10&gt;"</span><span style="color: #b16286;">)</span> 'dictionary-lookup-definition<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">Buffer-menu-mode</span>
 <span style="color: #458588;">(</span>define-key Buffer-menu-mode-map <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #b16286;">)</span> 'other-window<span style="color: #458588;">)</span>
 <span style="color: #458588;">(</span>define-key Buffer-menu-mode-map <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"M-o"</span><span style="color: #b16286;">)</span> 'previous-multiframe-window<span style="color: #458588;">)</span>
 <span style="color: #98be65;">;; </span><span style="color: #98be65;">"o" opens in another buffer and moves focus</span>
 <span style="color: #98be65;">;; </span><span style="color: #98be65;">"C-M-o" opens in another buffer and keeps focus in the Buffer-menu</span>
 <span style="color: #458588;">(</span>define-key Buffer-menu-mode-map <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-M-o"</span><span style="color: #b16286;">)</span> 'Buffer-menu-switch-other-window<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">compilation-mode</span>
 <span style="color: #458588;">(</span>define-key compilation-mode-map <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #b16286;">)</span> 'other-window<span style="color: #458588;">)</span>

 <span style="color: #98be65;">;; </span><span style="color: #98be65;">grep-mode</span>
 <span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-grep-keybindings</span><span style="color: #b16286;">()</span>
   <span style="color: #b16286;">(</span>define-key grep-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"o"</span><span style="color: #8ec07c;">)</span> 'compilation-display-error<span style="color: #b16286;">)</span>
   <span style="color: #b16286;">(</span>define-key grep-mode-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #8ec07c;">)</span> 'other-window<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

 <span style="color: #458588;">(</span>add-hook 'grep-mode-hook #'jmn-grep-keybindings<span style="color: #458588;">)</span>
</pre>
</div>

<p>
<b>Possible TODO:</b> create my own keybindings as shown <a href="https://www.youtube.com/watch?v=xaZMwNELaJY">here</a>. hydra ties related commands into short bindings with a common prefix.
</p>
</div>
</div>

<div id="outline-container-org7c7586f" class="outline-4">
<h4 id="org7c7586f">Font size</h4>
<div class="outline-text-4" id="text-org7c7586f">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>set-face-attribute
 'default nil
 <span style="color: #cd8500;">:height</span> <span style="color: #b16286;">(</span>assoc-default <span style="color: #8ec07c;">(</span>system-name<span style="color: #8ec07c;">)</span> '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"xps"</span> . 115<span style="color: #d65d0e;">)</span>
                                        <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"dsk"</span> . 120<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> text-scale-mode-step 1.05<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfec0ddb" class="outline-4">
<h4 id="orgfec0ddb">General Helper Function</h4>
<div class="outline-text-4" id="text-orgfec0ddb">
</div>
<ul class="org-ul">
<li><a id="org3ef6919"></a>jmn-load-init<br />
<div class="outline-text-5" id="text-org3ef6919">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-init</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load <span style="color: #cdbe70;">"~/.emacs.d/init.el"</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org2ed7f35"></a>jmn-vscode-current-buffer-file-at-point<br />
<div class="outline-text-5" id="text-org2ed7f35">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn/vscode-current-buffer-file-at-point</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>start-process-shell-command <span style="color: #cdbe70;">"code"</span>
                               nil
                               <span style="color: #8ec07c;">(</span>concat <span style="color: #cdbe70;">"code --goto "</span>
                                       <span style="color: #d65d0e;">(</span>buffer-file-name<span style="color: #d65d0e;">)</span>
                                       <span style="color: #cdbe70;">":"</span>
                                       <span style="color: #d65d0e;">(</span>number-to-string <span style="color: #458588;">(</span>line-number-at-pos<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
                                       <span style="color: #cdbe70;">":"</span>
                                       <span style="color: #98be65;">;; </span><span style="color: #98be65;">+1 who knows why</span>
                                       <span style="color: #d65d0e;">(</span>number-to-string <span style="color: #458588;">(</span>+ 1 <span style="color: #b16286;">(</span>current-column<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>define-key global-map <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f12&gt;"</span><span style="color: #b16286;">)</span>
            'jmn-vscode-current-buffer-file-at-point<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org995643d" class="outline-2">
<h2 id="org995643d">General Development</h2>
<div class="outline-text-2" id="text-org995643d">
</div>
