emacs.org
** Line numbers
#+begin_src emacs-lisp :tangle no
  (defun jmn-display-lines-for-long-files()
    (if (> (car (page--count-lines-page) ) 300)
        (display-line-numbers-mode 1)))

  (add-hook 'prog-mode-hook #'jmn-display-lines-for-long-files)

  ;; exlusion list
  ;;(dolist (mode '())
  ;;  (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src

** Flyspell comments
#+begin_src emacs-lisp
(add-hook 'prog-mode-hook #'flyspell-prog-mode)
#+end_src

** Parens/delimiters
#+begin_src emacs-lisp
(show-paren-mode    1) ; Highlight parentheses pairs.
#+end_src

*** Rainbow Delimiters
#+begin_src emacs-lisp
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

*** Smartparens NOT USED
Auto-creates closing parenthesis and bar and, smartly, writes it over if it is typed.
#+begin_src emacs-lisp :tangle no
  (use-package smartparens
    :hook (prog-mode . smartparens-mode))
#+end_src

** Magit
[[https://magit.vc/][Magit Documentation]]
#+begin_src emacs-lisp
  (use-package magit
    :commands (magit-status)
    ;; :custom
    ;; ;display Magit status buffer in the same buffer rather than splitting it.
    ;; (magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)
    )
#+end_src

** Git-Gutter
Git-gutter+ allows for git commands
#+begin_src emacs-lisp :tangle no
  (use-package git-gutter+
    :hook prog-mode
    :defer t)
#+end_src

** Highlight-indent-guide
Could not get the configs to work with lazy loading.
#+begin_src emacs-lisp
  (use-package highlight-indent-guides
    :hook prog-mode
    :config
    (setq highlight-indent-guides-method 'character)
    (setq highlight-indent-guides-auto-character-face-perc 50))
#+end_src

** Company-Mode
Currently company-mode gets called with lsp-mode by default. /my understanding/: company-mode provides the auto-complete box that lsp provides information to.

Issue: company mode not working in org-mode. Correct completion keys are not clear.
#+begin_src emacs-lisp
  (use-package company
    :ensure t
    :custom
    (company-minimum-prefix-length 1)
    (company-idle-delay 0.5)
    ;; (global-set-key (kbd "C-<tab>") 'company-complete)
  )
  (global-company-mode 1)
#+end_src

*** company-box-mode
Brings up a another box with information about the highlighted recommended item in the company/lsp box.
#+begin_src emacs-lisp
   (use-package company-box
     :hook (company-mode . company-box-mode))
#+end_src

*** company-prescient
Help in sorting the completion results.
#+begin_src emacs-lisp
(use-package company-prescient
  :defer 2
  :after company
  :config
  (company-prescient-mode +1))
#+end_src

** LSP and DAP
*** lsp-mode
Provides language backend to company-mode.
#+begin_src emacs-lisp  
  (use-package lsp-mode
    :delight lsp-mode
    :commands (lsp)
    :init
    (setq lsp-keymap-prefix "C-c l") ;; or "C-l"
    :custom ((lsp-idle-delay 0.5)) ;; 0.5 is the defualt
    :config
    (lsp-enable-which-key-integration t)
    ;; Annoying stuff (uncomment to turn off)
    ;; (setq lsp-enable-links nil)
    ;; (setq lsp-signature-render-documentation nil)
    (setq lsp-headerline-breadcrumb-enable nil)
    ;; (setq lsp-ui-doc-enable nil)
    ;; (setq lsp-completion-enable-additional-text-edit nil)


    ;; `-background-index' requires clangd v8+!
    (setq lsp-clients-clangd-args '("-j=4" "-background-index" "-log=error"))
    )
#+end_src
The last line concerning =cangd= comes from [[https://www.mortens.dev/blog/emacs-and-the-language-server-protocol/index.html][mortens.dev]].

