emacs.html
<div id="outline-container-org485f2a6" class="outline-3">
<h3 id="org485f2a6">Line numbers</h3>
<div class="outline-text-3" id="text-org485f2a6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-display-lines-for-long-files</span><span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">if</span> <span style="color: #8ec07c;">(</span>&gt; <span style="color: #d65d0e;">(</span>car <span style="color: #458588;">(</span>page--count-lines-page<span style="color: #458588;">)</span> <span style="color: #d65d0e;">)</span> 300<span style="color: #8ec07c;">)</span>
      <span style="color: #8ec07c;">(</span>display-line-numbers-mode 1<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>add-hook 'prog-mode-hook #'jmn-display-lines-for-long-files<span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">exlusion list</span>
<span style="color: #98be65;">;;</span><span style="color: #98be65;">(dolist (mode '())</span>
<span style="color: #98be65;">;;  </span><span style="color: #98be65;">(add-hook mode (lambda () (display-line-numbers-mode 0))))</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf45debc" class="outline-3">
<h3 id="orgf45debc">Flyspell comments</h3>
<div class="outline-text-3" id="text-orgf45debc">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>add-hook 'prog-mode-hook #'flyspell-prog-mode<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd002e4" class="outline-3">
<h3 id="orgfd002e4">Parens/delimiters</h3>
<div class="outline-text-3" id="text-orgfd002e4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>show-paren-mode    1<span style="color: #458588;">)</span> <span style="color: #98be65;">; </span><span style="color: #98be65;">Highlight parentheses pairs.</span>
</pre>
</div>
</div>

<div id="outline-container-orgffb4826" class="outline-4">
<h4 id="orgffb4826">Rainbow Delimiters</h4>
<div class="outline-text-4" id="text-orgffb4826">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">rainbow-delimiters</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>prog-mode . rainbow-delimiters-mode<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org03f29a7" class="outline-4">
<h4 id="org03f29a7">Smartparens NOT USED</h4>
<div class="outline-text-4" id="text-org03f29a7">
<p>
Auto-creates closing parenthesis and bar and, smartly, writes it over if it is typed.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">smartparens</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>prog-mode . smartparens-mode<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org686afa5" class="outline-3">
<h3 id="org686afa5">Magit</h3>
<div class="outline-text-3" id="text-org686afa5">
<p>
<a href="https://magit.vc/">Magit Documentation</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">magit</span>
  <span style="color: #cd8500;">:commands</span> <span style="color: #b16286;">(</span>magit-status<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">:custom</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">;display Magit status buffer in the same buffer rather than splitting it.</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(magit-display-buffer-function #'magit-display-buffer-same-window-except-diff-v1)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgea034f5" class="outline-3">
<h3 id="orgea034f5">Git-Gutter</h3>
<div class="outline-text-3" id="text-orgea034f5">
<p>
Git-gutter+ allows for git commands
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">git-gutter+</span>
  <span style="color: #cd8500;">:hook</span> prog-mode
  <span style="color: #cd8500;">:defer</span> t<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb15578f" class="outline-3">
<h3 id="orgb15578f">Highlight-indent-guide</h3>
<div class="outline-text-3" id="text-orgb15578f">
<p>
Could not get the configs to work with lazy loading.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">highlight-indent-guides</span>
  <span style="color: #cd8500;">:hook</span> prog-mode
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> highlight-indent-guides-method 'character<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> highlight-indent-guides-auto-character-face-perc 50<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4513d9" class="outline-3">
<h3 id="orga4513d9">Company-Mode</h3>
<div class="outline-text-3" id="text-orga4513d9">
<p>
Currently company-mode gets called with lsp-mode by default. <i>my understanding</i>: company-mode provides the auto-complete box that lsp provides information to.
</p>

<p>
Issue: company mode not working in org-mode. Correct completion keys are not clear.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">company</span>
  <span style="color: #cd8500;">:ensure</span> t
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>company-minimum-prefix-length 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>company-idle-delay 0.5<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(global-set-key (kbd "C-&lt;tab&gt;") 'company-complete)</span>
<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>global-company-mode 1<span style="color: #458588;">)</span>
</pre>
</div>
</div>

<div id="outline-container-org31fa47f" class="outline-4">
<h4 id="org31fa47f">company-box-mode</h4>
<div class="outline-text-4" id="text-org31fa47f">
<p>
Brings up a another box with information about the highlighted recommended item in the company/lsp box.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">company-box</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>company-mode . company-box-mode<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1e45163" class="outline-4">
<h4 id="org1e45163">company-prescient</h4>
<div class="outline-text-4" id="text-org1e45163">
<p>
Help in sorting the completion results.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">company-prescient</span>
  <span style="color: #cd8500;">:defer</span> 2
  <span style="color: #cd8500;">:after</span> company
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>company-prescient-mode +1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d542bf" class="outline-3">
<h3 id="org3d542bf">LSP and DAP</h3>
<div class="outline-text-3" id="text-org3d542bf">
</div>
<div id="outline-container-org85753f7" class="outline-4">
<h4 id="org85753f7">lsp-mode</h4>
<div class="outline-text-4" id="text-org85753f7">
<p>
Provides language backend to company-mode.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-mode</span>
  <span style="color: #cd8500;">:delight</span> lsp-mode
  <span style="color: #cd8500;">:commands</span> <span style="color: #b16286;">(</span>lsp<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:init</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> lsp-keymap-prefix <span style="color: #cdbe70;">"C-c l"</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">or "C-l"</span>
  <span style="color: #cd8500;">:custom</span> <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>lsp-idle-delay 0.5<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">0.5 is the defualt</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>lsp-enable-which-key-integration t<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Annoying stuff (uncomment to turn off)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(setq lsp-enable-links nil)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(setq lsp-signature-render-documentation nil)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> lsp-headerline-breadcrumb-enable nil<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(setq lsp-ui-doc-enable nil)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(setq lsp-completion-enable-additional-text-edit nil)</span>


  <span style="color: #98be65;">;; </span><span style="color: #98be65;">`</span><span style="color: #d3869b;">-background-index</span><span style="color: #98be65;">' requires clangd v8+!</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> lsp-clients-clangd-args '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"-j=4"</span> <span style="color: #cdbe70;">"-background-index"</span> <span style="color: #cdbe70;">"-log=error"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
<p>
The last line concerning <code>cangd</code> comes from <a href="https://www.mortens.dev/blog/emacs-and-the-language-server-protocol/index.html">mortens.dev</a>.
</p>
</div>
</div>
