emacs.org
*** lsp-ui
Provides additional lsp information to the company-mode box. The mode provides info when hoovered by mouse. [[https://emacs-lsp.github.io/lsp-ui/][lsp-ui documentation]]

*Note:* Functions also display the proceeding C++ function comments as documentation
#+begin_src emacs-lisp  
  (use-package lsp-ui
    :hook (lsp-mode . lsp-ui-mode) ; for elpy
    :custom
    (lsp-ui-doc-position 'bottom))
#+end_src

*** lsp-ivy
[[https://github.com/emacs-lsp/lsp-ivy][lsp-ivy]] integrates Ivy with =lsp-mode= to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.

Try these commands with =M-x=:
- =lsp-ivy-workspace-symbol= - Search for a symbol name in the current project workspace
- =lsp-ivy-global-workspace-symbol= - Search for a symbol name in all active project workspaces.

#+begin_src emacs-lisp
  (use-package lsp-ivy
    :after lsp)
#+end_src

*** lsp-treemacs
Shows file contents: classes functions etc
- See lsp-treemacs-references
#+begin_src emacs-lisp
  (use-package lsp-treemacs
    :after lsp)
#+end_src

*** Dap Debugging
Like lsp-mode but for debuggers.
#+begin_src emacs-lisp
  (use-package dap-mode
    :commands dap-mode)
#+end_src

** Flycheck
Checks the code for bugs on the fly.
#+begin_src emacs-lisp
  (use-package flycheck
    :diminish flycheck-mode
    :after lsp)
#+end_src

** CMake
Lsp-mode requires the language server on the system:
=pip install cmake-language-server=.
*** CMake-mode
#+begin_src emacs-lisp
  (use-package cmake-mode
    :mode ("CMakeLists\\.txt\\'" "\\.cmake\\'")
    :hook (cmake-mode . lsp))

  (use-package cmake-font-lock
  :ensure t
  :after cmake-mode
  :config (cmake-font-lock-activate))
#+end_src

*** CMake project
In the source directory containing ~CMakeLists.txt~ run =M-x cmake-project-configure-project=.
As a preference, use the =/bin/= option to keep the cmake files out of the source directory.
After this, the =compile= automatically holds the correct command.
#+begin_src emacs-lisp
  (use-package cmake-project
    :hook ((c++-mode . cmake-project-mode )
           (c-mode . cmake-project-mode))
    )
#+end_src

** Yasnippet
#+begin_src emacs-lisp
  (use-package yasnippet
    :delight( yas-minor-mode)
    :after lsp)

  (use-package yasnippet-snippets
    :after yas-minor-mode) ; load basic snippets from melpa

  (yas-global-mode 1)
#+end_src

** Flyspell
#+begin_src emacs-lisp
  (use-package flyspell
    :ensure nil
    :bind (:map flyspell-mode-map ("C-;" . nil)))
#+end_src

** Evil nerd commenter
#+begin_src emacs-lisp
  (use-package evil-nerd-commenter
  :bind ("M-;". evilnc-comment-or-uncomment-lines))
#+end_src

** Tree Sitter Highlighting
#+begin_src emacs-lisp
  (use-package tree-sitter-langs)
  ;; add hooks in languages below (1/23 not available for elisp)
#+end_src

* Languages
** Emacs-lisp
- use =C-c '= to view elisp babel blocks in their own file (to get completion).
#+begin_src emacs-lisp
  ; (add-hook 'emacs-lisp-mode-hook #'flycheck-mode)
#+end_src

