emacs.html

<div id="outline-container-org3bfb519" class="outline-4">
<h4 id="org3bfb519">lsp-ui</h4>
<div class="outline-text-4" id="text-org3bfb519">
<p>
Provides additional lsp information to the company-mode box. The mode provides info when hoovered by mouse. <a href="https://emacs-lsp.github.io/lsp-ui/">lsp-ui documentation</a>
</p>

<p>
<b>Note:</b> Functions also display the proceeding C++ function comments as documentation
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-ui</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>lsp-mode . lsp-ui-mode<span style="color: #b16286;">)</span> <span style="color: #98be65;">; </span><span style="color: #98be65;">for elpy</span>
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>lsp-ui-doc-position 'bottom<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb576ef3" class="outline-4">
<h4 id="orgb576ef3">lsp-ivy</h4>
<div class="outline-text-4" id="text-orgb576ef3">
<p>
<a href="https://github.com/emacs-lsp/lsp-ivy">lsp-ivy</a> integrates Ivy with <code>lsp-mode</code> to make it easy to search for things by name in your code.  When you run these commands, a prompt will appear in the minibuffer allowing you to type part of the name of a symbol in your code.  Results will be populated in the minibuffer so that you can find what you're looking for and jump to that location in the code upon selecting the result.
</p>

<p>
Try these commands with <code>M-x</code>:
</p>
<ul class="org-ul">
<li><code>lsp-ivy-workspace-symbol</code> - Search for a symbol name in the current project workspace</li>
<li><code>lsp-ivy-global-workspace-symbol</code> - Search for a symbol name in all active project workspaces.</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-ivy</span>
  <span style="color: #cd8500;">:after</span> lsp<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2299438" class="outline-4">
<h4 id="org2299438">lsp-treemacs</h4>
<div class="outline-text-4" id="text-org2299438">
<p>
Shows file contents: classes functions etc
</p>
<ul class="org-ul">
<li>See lsp-treemacs-references</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-treemacs</span>
  <span style="color: #cd8500;">:after</span> lsp<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3dc9519" class="outline-4">
<h4 id="org3dc9519">Dap Debugging</h4>
<div class="outline-text-4" id="text-org3dc9519">
<p>
Like lsp-mode but for debuggers.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">dap-mode</span>
  <span style="color: #cd8500;">:commands</span> dap-mode<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org351519b" class="outline-3">
<h3 id="org351519b">Flycheck</h3>
<div class="outline-text-3" id="text-org351519b">
<p>
Checks the code for bugs on the fly.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">flycheck</span>
  <span style="color: #cd8500;">:diminish</span> flycheck-mode
  <span style="color: #cd8500;">:after</span> lsp<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgafdaafb" class="outline-3">
<h3 id="orgafdaafb">CMake</h3>
<div class="outline-text-3" id="text-orgafdaafb">
<p>
Lsp-mode requires the language server on the system:
<code>pip install cmake-language-server</code>.
</p>
</div>
<div id="outline-container-org73fdac2" class="outline-4">
<h4 id="org73fdac2">CMake-mode</h4>
<div class="outline-text-4" id="text-org73fdac2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">cmake-mode</span>
  <span style="color: #cd8500;">:mode</span> <span style="color: #b16286;">(</span><span style="color: #cdbe70;">"CMakeLists\\.txt\\'"</span> <span style="color: #cdbe70;">"\\.cmake\\'"</span><span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>cmake-mode . lsp<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">cmake-font-lock</span>
<span style="color: #cd8500;">:ensure</span> t
<span style="color: #cd8500;">:after</span> cmake-mode
<span style="color: #cd8500;">:config</span> <span style="color: #b16286;">(</span>cmake-font-lock-activate<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb15baf6" class="outline-4">
<h4 id="orgb15baf6">CMake project</h4>
<div class="outline-text-4" id="text-orgb15baf6">
<p>
In the source directory containing <code>CMakeLists.txt</code> run <code>M-x cmake-project-configure-project</code>.
As a preference, use the <code>/bin/</code> option to keep the cmake files out of the source directory.
After this, the <code>compile</code> automatically holds the correct command.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">cmake-project</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>c++-mode . cmake-project-mode <span style="color: #8ec07c;">)</span>
         <span style="color: #8ec07c;">(</span>c-mode . cmake-project-mode<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd5763c5" class="outline-3">
<h3 id="orgd5763c5">Yasnippet</h3>
<div class="outline-text-3" id="text-orgd5763c5">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">yasnippet</span>
  <span style="color: #cd8500;">:delight</span><span style="color: #b16286;">(</span> yas-minor-mode<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:after</span> lsp<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">yasnippet-snippets</span>
  <span style="color: #cd8500;">:after</span> yas-minor-mode<span style="color: #458588;">)</span> <span style="color: #98be65;">; </span><span style="color: #98be65;">load basic snippets from melpa</span>

<span style="color: #458588;">(</span>yas-global-mode 1<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org61a7880" class="outline-3">
<h3 id="org61a7880">Flyspell</h3>
<div class="outline-text-3" id="text-org61a7880">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">flyspell</span>
  <span style="color: #cd8500;">:ensure</span> nil
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #cd8500;">:map</span> flyspell-mode-map <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"C-;"</span> . nil<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5ec417" class="outline-3">
<h3 id="orgb5ec417">Evil nerd commenter</h3>
<div class="outline-text-3" id="text-orgb5ec417">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">evil-nerd-commenter</span>
<span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #cdbe70;">"M-;"</span>. evilnc-comment-or-uncomment-lines<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a86625" class="outline-3">
<h3 id="org9a86625">Tree Sitter Highlighting</h3>
<div class="outline-text-3" id="text-org9a86625">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">tree-sitter-langs</span><span style="color: #458588;">)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">add hooks in languages below (1/23 not available for elisp)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org6fa2a73" class="outline-2">
<h2 id="org6fa2a73">Languages</h2>
<div class="outline-text-2" id="text-org6fa2a73">
</div>
<div id="outline-container-org75248f6" class="outline-3">
<h3 id="org75248f6">Emacs-lisp</h3>
<div class="outline-text-3" id="text-org75248f6">
<ul class="org-ul">
<li>use <code>C-c '</code> to view elisp babel blocks in their own file (to get completion).</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">; </span><span style="color: #98be65;">(add-hook 'emacs-lisp-mode-hook #'flycheck-mode)</span>
</pre>
</div>
</div>
</div>
