emacs.org
** Bash
- Flycheck uses shellcheck, which requires ~sudo dnf install -y shellcheck~
- debuggers are available
- If language server doesn't install automatically either:
  1. Fedora:  ~sudo dnf -y nodejs-bash-language-server.noarch~
  2. =M-x lsp-install-server=

#+begin_src emacs-lisp
  (defun my-sh-mode-hook-fn()
    (setq sh-basic-offset 2
          sh-indentation 2) ;; defaults are 4
    (tree-sitter-hl-mode)
    (lsp))

  (use-package sh-script
      :ensure-system-package
      ((bash-language-server . "sudo dnf install -y nodejs-bash-language-server"))
      :config
      (setq sh-basic-offset 2
            sh-indentation 2) ;; defaults are 4
      (add-hook 'sh-mode-hook #'my-sh-mode-hook-fn))
#+end_src

** Python
*** TODO Jupyter Notebooks
**** TODO run Jupyter in babel
[[https://sqrtminusone.xyz/posts/2021-05-01-org-python/][Reference]] and https://github.com/jkitchin/scimax
Cannot get zmq (Jupyter dependency)  to work currently
#+begin_src emacs-lisp :tangle no
    (use-package jupyter
        :after (org)
        ;; :straight t
        )

    (org-babel-do-load-languages 'org-babel-load-languages
                                 (append org-babel-load-languages
                                         '((jupyter . t))))
#+end_src

**** TODO open notebook in Emacs
If I use EIN, add the setting for displaying the figures inline.
#+begin_src emacs-lisp
  (use-package ein
    :commands (ein:notebooklist-open)
    ;; :config
    ;; (require 'ein-loaddefs)
    ;; (require 'ein)
    ;; (define-key ein:notebook-mode-map (kbd "<C-tab>") 'my-function)
    )
#+end_src

**** TODO completion
In [[https://www.youtube.com/watch?v=OB9vFu9Za8w][EIN video]], Miller says that the completion is based on =auto-complete= rather than =company=. So here we are going to try to get completion setup for =EIN=.
Also, in [[https://github.com/millejoh/emacs-ipython-notebook#ob-ein][EIN github]], Miller says that =EIN= is an =elpy= module, so maybe we need =elpy= for completion?

*** Pyvenv
#+begin_src emacs-lisp
  (use-package pyvenv
  :ensure t
  :defer t
  :diminish
  :config

  (setenv "WORKON_HOME" "/home/ape/.conda/envs")
          ; Show python venv name in modeline
          (setq pyvenv-mode-line-indicator '(pyvenv-virtual-env-name ("[venv:" pyvenv-virtual-env-name "] ")))
          (pyvenv-mode t))
#+end_src

After package installation, you should have =M-x pyvenv-workon= command with a list of your virtual environments.

The only lack of this is that you need to restart LSP workspace at least once when you change venv by pyvenv-workon command.

So the flow should be like this:

=M-x pyvenv-workon <your-venv>=  # or conda environment?
=M-x lsp-restart-workspace=

After changing venv all installed packages from venv should be visible for LSP server.

*** Python-mode
**** Pyright
#+begin_src emacs-lisp
  ; npm must be installed on the system.
    (use-package lsp-pyright
      :after lsp
      :hook (python-mode . (lambda ()
                              (require 'lsp-pyright)
                              (lsp))))
#+end_src

**** python-mode
#+begin_src emacs-lisp 
  (use-package python-mode
    :ensure nil ; don't install, use the pre-installed version

    :custom
    (python-shell-completion-native-enable 1)
    (python-shell-interpreter "ipython")
    (python-shell-interpreter-args "-i --simple-prompt")
    ; this command doesn't work BUT without, python-mode "won't load".
    :bind (:map python-mode-map ("C-RET" . python-shell-send-statement))
    )
#+end_src

*** Hook
#+begin_src emacs-lisp  
  (defun my-python-mode-hook-fn ()
    (lsp)
    (require 'dap-python)
    (tree-sitter-hl-mode)
    (jmn-display-lines-for-long-files))
    ;; (local-set-key (kbd "<tab>") #'company-indent-or-complete-common)

  (add-hook 'python-mode-hook #'my-python-mode-hook-fn)

#+end_src

** C/C++
