emacs.html

<div id="outline-container-org32b3d66" class="outline-3">
<h3 id="org32b3d66">Bash</h3>
<div class="outline-text-3" id="text-org32b3d66">
<ul class="org-ul">
<li>Flycheck uses shellcheck, which requires <code>sudo dnf install -y shellcheck</code></li>
<li>debuggers are available</li>
<li>If language server doesn't install automatically either:
<ol class="org-ol">
<li>Fedora:  <code>sudo dnf -y nodejs-bash-language-server.noarch</code></li>
<li><code>M-x lsp-install-server</code></li>
</ol></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-sh-mode-hook-fn</span><span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> sh-basic-offset 2
        sh-indentation 2<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">defaults are 4</span>
  <span style="color: #b16286;">(</span>tree-sitter-hl-mode<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>lsp<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">sh-script</span>
    <span style="color: #cd8500;">:ensure-system-package</span>
    <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>bash-language-server . <span style="color: #cdbe70;">"sudo dnf install -y nodejs-bash-language-server"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
    <span style="color: #cd8500;">:config</span>
    <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> sh-basic-offset 2
          sh-indentation 2<span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">defaults are 4</span>
    <span style="color: #b16286;">(</span>add-hook 'sh-mode-hook #'my-sh-mode-hook-fn<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org713a63b" class="outline-3">
<h3 id="org713a63b">Python</h3>
<div class="outline-text-3" id="text-org713a63b">
</div>
<div id="outline-container-org4d47179" class="outline-4">
<h4 id="org4d47179"><span class="todo TODO">TODO</span> Jupyter Notebooks</h4>
<div class="outline-text-4" id="text-org4d47179">
</div>
<ul class="org-ul">
<li><a id="org3fc3ae3"></a><span class="todo TODO">TODO</span> run Jupyter in babel<br />
<div class="outline-text-5" id="text-org3fc3ae3">
<p>
<a href="https://sqrtminusone.xyz/posts/2021-05-01-org-python/">Reference</a> and <a href="https://github.com/jkitchin/scimax">https://github.com/jkitchin/scimax</a>
Cannot get zmq (Jupyter dependency)  to work currently
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">jupyter</span>
    <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span>org<span style="color: #b16286;">)</span>
    <span style="color: #98be65;">;; </span><span style="color: #98be65;">:straight t</span>
    <span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>org-babel-do-load-languages 'org-babel-load-languages
                             <span style="color: #b16286;">(</span>append org-babel-load-languages
                                     '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>jupyter . t<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org5dcd9df"></a><span class="todo TODO">TODO</span> open notebook in Emacs<br />
<div class="outline-text-5" id="text-org5dcd9df">
<p>
If I use EIN, add the setting for displaying the figures inline.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">ein</span>
  <span style="color: #cd8500;">:commands</span> <span style="color: #b16286;">(</span>ein:notebooklist-open<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">:config</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(require 'ein-loaddefs)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(require 'ein)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(define-key ein:notebook-mode-map (kbd "&lt;C-tab&gt;") 'my-function)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="org9bcdeb6"></a><span class="todo TODO">TODO</span> completion<br />
<div class="outline-text-5" id="text-org9bcdeb6">
<p>
In <a href="https://www.youtube.com/watch?v=OB9vFu9Za8w">EIN video</a>, Miller says that the completion is based on <code>auto-complete</code> rather than <code>company</code>. So here we are going to try to get completion setup for <code>EIN</code>.
Also, in <a href="https://github.com/millejoh/emacs-ipython-notebook#ob-ein">EIN github</a>, Miller says that <code>EIN</code> is an <code>elpy</code> module, so maybe we need <code>elpy</code> for completion?
</p>
</div>
</li>
</ul>
</div>

<div id="outline-container-org22c1a35" class="outline-4">
<h4 id="org22c1a35">Pyvenv</h4>
<div class="outline-text-4" id="text-org22c1a35">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">pyvenv</span>
<span style="color: #cd8500;">:ensure</span> t
<span style="color: #cd8500;">:defer</span> t
<span style="color: #cd8500;">:diminish</span>
<span style="color: #cd8500;">:config</span>

<span style="color: #b16286;">(</span>setenv <span style="color: #cdbe70;">"WORKON_HOME"</span> <span style="color: #cdbe70;">"/home/ape/.conda/envs"</span><span style="color: #b16286;">)</span>
        <span style="color: #98be65;">; </span><span style="color: #98be65;">Show python venv name in modeline</span>
        <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> pyvenv-mode-line-indicator '<span style="color: #8ec07c;">(</span>pyvenv-virtual-env-name <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"[venv:"</span> pyvenv-virtual-env-name <span style="color: #cdbe70;">"] "</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
        <span style="color: #b16286;">(</span>pyvenv-mode t<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
After package installation, you should have <code>M-x pyvenv-workon</code> command with a list of your virtual environments.
</p>

<p>
The only lack of this is that you need to restart LSP workspace at least once when you change venv by pyvenv-workon command.
</p>

<p>
So the flow should be like this:
</p>

<p>
<code>M-x pyvenv-workon &lt;your-venv&gt;</code>  # or conda environment?
<code>M-x lsp-restart-workspace</code>
</p>

<p>
After changing venv all installed packages from venv should be visible for LSP server.
</p>
</div>
</div>

<div id="outline-container-org71a11c6" class="outline-4">
<h4 id="org71a11c6">Python-mode</h4>
<div class="outline-text-4" id="text-org71a11c6">
</div>
<ul class="org-ul">
<li><a id="orge3950ca"></a>Pyright<br />
<div class="outline-text-5" id="text-orge3950ca">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">; </span><span style="color: #98be65;">npm must be installed on the system.</span>
  <span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">lsp-pyright</span>
    <span style="color: #cd8500;">:after</span> lsp
    <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>python-mode . <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #d65d0e;">()</span>
                            <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">lsp-pyright</span><span style="color: #d65d0e;">)</span>
                            <span style="color: #d65d0e;">(</span>lsp<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>

<li><a id="orgca92f88"></a>python-mode<br />
<div class="outline-text-5" id="text-orgca92f88">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">python-mode</span>
  <span style="color: #cd8500;">:ensure</span> nil <span style="color: #98be65;">; </span><span style="color: #98be65;">don't install, use the pre-installed version</span>

  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>python-shell-completion-native-enable 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>python-shell-interpreter <span style="color: #cdbe70;">"ipython"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>python-shell-interpreter-args <span style="color: #cdbe70;">"-i --simple-prompt"</span><span style="color: #b16286;">)</span>
  <span style="color: #98be65;">; </span><span style="color: #98be65;">this command doesn't work BUT without, python-mode "won't load".</span>
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #cd8500;">:map</span> python-mode-map <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"C-RET"</span> . python-shell-send-statement<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</li>
</ul>
</div>

<div id="outline-container-org79687d6" class="outline-4">
<h4 id="org79687d6">Hook</h4>
<div class="outline-text-4" id="text-org79687d6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-python-mode-hook-fn</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span>lsp<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">dap-python</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>tree-sitter-hl-mode<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>jmn-display-lines-for-long-files<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(local-set-key (kbd "&lt;tab&gt;") #'company-indent-or-complete-common)</span>

<span style="color: #458588;">(</span>add-hook 'python-mode-hook #'my-python-mode-hook-fn<span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>
</div>
