emacs.org
*** Compilation Buffer
Have the =*Compilation*= buffer scroll with the output.
#+begin_src emacs-lisp
  (setq compilation-scroll-output t)
#+end_src

The following keeps the compilation buffer if there are warnings or errors, and buries it otherwise (after 1 second). [[https://stackoverflow.com/questions/11043004/emacs-compile-buffer-auto-close][source]]
#+begin_src emacs-lisp
(defun bury-compile-buffer-if-successful (buffer string)
 "Bury a compilation buffer if succeeded without warnings "
 (when (and
         (buffer-live-p buffer)
         (string-match "compilation" (buffer-name buffer))
         (string-match "finished" string)
         (not
          (with-current-buffer buffer
            (goto-char (point-min))
            (search-forward "warning" nil t))))
    (run-with-timer 1 nil
                    (lambda (buf)
                      (bury-buffer buf)
                      (switch-to-prev-buffer (get-buffer-window buf) 'kill))
                    buffer)))
(add-hook 'compilation-finish-functions 'bury-compile-buffer-if-successful)
#+end_src

*** Hook
  Currently lsp-mode works with clangd backend without any initial setup.
  company-clang needs =clang= installed on the system.
  #+begin_src emacs-lisp
    (setq-default c-basic-offset 2)

    (defun my-c-c++-mode-hook-fn ()
      (lsp)                ; turn on
      (local-set-key (kbd "C-<tab>") #'lsp-format-buffer) ;tab comp
      ;(smartparens-mode 1) no longer have it?
      (tree-sitter-hl-mode 1))

    (add-hook #'c-mode-hook #'my-c-c++-mode-hook-fn)
    (add-hook #'c++-mode-hook #'my-c-c++-mode-hook-fn)
#+end_src

* Org-Mode
** Mode setup
#+begin_src emacs-lisp 
  (defun jmn/org-mode-setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (visual-line-mode 1)
    (rainbow-delimiters-mode 0)
    ;; fix issue where it matches > with partentheses -- may break blocks with <>
    (modify-syntax-entry ?< ".")
    (modify-syntax-entry ?> ".")
    )
#+end_src

** Fonts
#+begin_src emacs-lisp
           (defun jmn/org-font-setup ()

             ;; Replace list hyphen with dot
             (font-lock-add-keywords 'org-mode
                                '(("^ *\\([-]\\) "
                                 (0 (prog1 () (compose-region (match-beginning 1)
                                                              (match-end 1) "•"))))))

             ;; Set faces for heading levels
             (dolist (face '((org-level-1 . 1.2)
                             (org-level-2 . 1.1)
                             (org-level-3 . 1.1)
                             (org-level-4 . 1.1)
                             (org-level-5 . 1.1)
                             (org-level-6 . 1.1)
                             (org-level-7 . 1.1)
                             (org-level-8 . 1.1)
                             ))
               (set-face-attribute (car face) nil :font "Cantarell"
                                   :weight 'regular :height (cdr face)))

             ;; Ensure that anything that should be fixed-pitch in Org files appears that way
             (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
             (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
             (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
             (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
             (set-face-attribute 'org-special-keyword nil
                                 :inherit '(font-lock-comment-face fixed-pitch))
             (set-face-attribute 'org-meta-line nil
                                 :inherit '(font-lock-comment-face fixed-pitch))
             (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+end_src

