emacs.html

<div id="outline-container-org9dd0762" class="outline-3">
<h3 id="org9dd0762">C/C++</h3>
<div class="outline-text-3" id="text-org9dd0762">
</div>
<div id="outline-container-org6782ca6" class="outline-4">
<h4 id="org6782ca6">Compilation Buffer</h4>
<div class="outline-text-4" id="text-org6782ca6">
<p>
Have the <code>*Compilation*</code> buffer scroll with the output.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> compilation-scroll-output t<span style="color: #458588;">)</span>
</pre>
</div>

<p>
The following keeps the compilation buffer if there are warnings or errors, and buries it otherwise (after 1 second). <a href="https://stackoverflow.com/questions/11043004/emacs-compile-buffer-auto-close">source</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">bury-compile-buffer-if-successful</span> <span style="color: #b16286;">(</span>buffer string<span style="color: #b16286;">)</span>
 <span style="color: #cdbe70;">"Bury a compilation buffer if succeeded without warnings "</span>
 <span style="color: #b16286;">(</span><span style="color: #fb4933;">when</span> <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">and</span>
         <span style="color: #d65d0e;">(</span>buffer-live-p buffer<span style="color: #d65d0e;">)</span>
         <span style="color: #d65d0e;">(</span>string-match <span style="color: #cdbe70;">"compilation"</span> <span style="color: #458588;">(</span>buffer-name buffer<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
         <span style="color: #d65d0e;">(</span>string-match <span style="color: #cdbe70;">"finished"</span> string<span style="color: #d65d0e;">)</span>
         <span style="color: #d65d0e;">(</span>not
          <span style="color: #458588;">(</span><span style="color: #fb4933;">with-current-buffer</span> buffer
            <span style="color: #b16286;">(</span>goto-char <span style="color: #8ec07c;">(</span>point-min<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
            <span style="color: #b16286;">(</span>search-forward <span style="color: #cdbe70;">"warning"</span> nil t<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>run-with-timer 1 nil
                    <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #458588;">(</span>buf<span style="color: #458588;">)</span>
                      <span style="color: #458588;">(</span>bury-buffer buf<span style="color: #458588;">)</span>
                      <span style="color: #458588;">(</span>switch-to-prev-buffer <span style="color: #b16286;">(</span>get-buffer-window buf<span style="color: #b16286;">)</span> 'kill<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
                    buffer<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-hook 'compilation-finish-functions 'bury-compile-buffer-if-successful<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab3d887" class="outline-4">
<h4 id="orgab3d887">Hook</h4>
<div class="outline-text-4" id="text-orgab3d887">
<p>
Currently lsp-mode works with clangd backend without any initial setup.
company-clang needs <code>clang</code> installed on the system.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq-default</span> c-basic-offset 2<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">my-c-c++-mode-hook-fn</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span>lsp<span style="color: #b16286;">)</span>                <span style="color: #98be65;">; </span><span style="color: #98be65;">turn on</span>
  <span style="color: #b16286;">(</span>local-set-key <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"C-&lt;tab&gt;"</span><span style="color: #8ec07c;">)</span> #'lsp-format-buffer<span style="color: #b16286;">)</span> <span style="color: #98be65;">;</span><span style="color: #98be65;">tab comp</span>
  <span style="color: #98be65;">;</span><span style="color: #98be65;">(smartparens-mode 1) no longer have it?</span>
  <span style="color: #b16286;">(</span>tree-sitter-hl-mode 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>add-hook #'c-mode-hook #'my-c-c++-mode-hook-fn<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-hook #'c++-mode-hook #'my-c-c++-mode-hook-fn<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org657abda" class="outline-2">
<h2 id="org657abda">Org-Mode</h2>
<div class="outline-text-2" id="text-org657abda">
</div>
<div id="outline-container-org4feafc8" class="outline-3">
<h3 id="org4feafc8">Mode setup</h3>
<div class="outline-text-3" id="text-org4feafc8">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn/org-mode-setup</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span>org-indent-mode<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>variable-pitch-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>visual-line-mode 1<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>rainbow-delimiters-mode 0<span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">fix issue where it matches &gt; with partentheses -- may break blocks with &lt;&gt;</span>
  <span style="color: #b16286;">(</span>modify-syntax-entry ?&lt; <span style="color: #cdbe70;">"."</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>modify-syntax-entry ?&gt; <span style="color: #cdbe70;">"."</span><span style="color: #b16286;">)</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org54ebb72" class="outline-3">
<h3 id="org54ebb72">Fonts</h3>
<div class="outline-text-3" id="text-org54ebb72">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn/org-font-setup</span> <span style="color: #b16286;">()</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Replace list hyphen with dot</span>
  <span style="color: #b16286;">(</span>font-lock-add-keywords 'org-mode
                     '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"^ *</span><span style="color: #cdbe70; font-weight: bold;">\\</span><span style="color: #cdbe70; font-weight: bold;">(</span><span style="color: #cdbe70;">[-]</span><span style="color: #cdbe70; font-weight: bold;">\\</span><span style="color: #cdbe70; font-weight: bold;">)</span><span style="color: #cdbe70;"> "</span>
                      <span style="color: #458588;">(</span>0 <span style="color: #b16286;">(</span><span style="color: #fb4933;">prog1</span> <span style="color: #8ec07c;">()</span> <span style="color: #8ec07c;">(</span>compose-region <span style="color: #d65d0e;">(</span>match-beginning 1<span style="color: #d65d0e;">)</span>
                                                   <span style="color: #d65d0e;">(</span>match-end 1<span style="color: #d65d0e;">)</span> <span style="color: #cdbe70;">"&#8226;"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Set faces for heading levels</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">dolist</span> <span style="color: #8ec07c;">(</span>face '<span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span>org-level-1 . 1.2<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-2 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-3 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-4 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-5 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-6 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-7 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #458588;">(</span>org-level-8 . 1.1<span style="color: #458588;">)</span>
                  <span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>set-face-attribute <span style="color: #d65d0e;">(</span>car face<span style="color: #d65d0e;">)</span> nil <span style="color: #cd8500;">:font</span> <span style="color: #cdbe70;">"Cantarell"</span>
                        <span style="color: #cd8500;">:weight</span> 'regular <span style="color: #cd8500;">:height</span> <span style="color: #d65d0e;">(</span>cdr face<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">Ensure that anything that should be fixed-pitch in Org files appears that way</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-block nil <span style="color: #cd8500;">:foreground</span> nil <span style="color: #cd8500;">:inherit</span> 'fixed-pitch<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-code nil   <span style="color: #cd8500;">:inherit</span> '<span style="color: #8ec07c;">(</span>shadow fixed-pitch<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-table nil   <span style="color: #cd8500;">:inherit</span> '<span style="color: #8ec07c;">(</span>shadow fixed-pitch<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-verbatim nil <span style="color: #cd8500;">:inherit</span> '<span style="color: #8ec07c;">(</span>shadow fixed-pitch<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-special-keyword nil
                      <span style="color: #cd8500;">:inherit</span> '<span style="color: #8ec07c;">(</span>font-lock-comment-face fixed-pitch<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-meta-line nil
                      <span style="color: #cd8500;">:inherit</span> '<span style="color: #8ec07c;">(</span>font-lock-comment-face fixed-pitch<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-attribute 'org-checkbox nil <span style="color: #cd8500;">:inherit</span> 'fixed-pitch<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
