emacs.org
** Start
#+begin_src emacs-lisp
  (use-package org
    :commands (org-capture org-agenda)
    :hook (org-mode . jmn/org-mode-setup)
    :config
    (jmn/org-font-setup)
    (setq org-ellipsis " ▾"
          org-hide-emphasis-markers t
          org-src-fontify-natively t
          org-fontify-quote-and-verse-blocks t
          org-src-tab-acts-natively t
          org-edit-src-content-indentation 2 ;; I think I undo this somewhere for de/tangling
          org-hide-block-startup nil
          org-src-preserve-indentation nil
          org-startup-folded 'content
          org-cycle-separator-lines 2
          org-capture-bookmark nil
          org-list-indent-offset 1
          org-image-actual-width nil ; fix to allow picture resizing
          org-return-follows-link t  ; keep for sure ;@work
          org-use-speed-commands t ; try out
          )
    (setq org-agenda-tags-column
        (assoc-default (system-name) '(("xps" . 75)
                                       ("dsk" . 75)))) ;; default is auto
    )
#+end_src

** Bullets
#+begin_src emacs-lisp 
  (use-package org-bullets
    :hook (org-mode . org-bullets-mode)
    :custom
    (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●")))
#+end_src

** Center column
#+begin_src emacs-lisp 
(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))

#+end_src

** Org-babel
Use # -*- org-src-preserve-indentation: t; -*- when doing tangle/detangle with python
#+begin_src emacs-lisp
  (org-babel-do-load-languages 'org-babel-load-languages
                               (append org-babel-load-languages
                                       '((shell  . t)
                                         (python . t)
                                         (latex  . t)
                                         (C      . t))))

  (setq org-confirm-babel-evaluate nil)

  (with-eval-after-load 'org
    ;; This is needed as of Org 9.2
    (require 'org-tempo)
    (add-to-list 'org-structure-template-alist '("la" . "src latex"))
    (add-to-list 'org-structure-template-alist '("js" . "src js"))
    (add-to-list 'org-structure-template-alist '("sh" . "src shell"))
    (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
    (add-to-list 'org-structure-template-alist '("py" . "src python  :results output"))
    (add-to-list 'org-structure-template-alist '("pyim" . "src python :results file :var f=strNameWithDoubleQuotes
  import matplotlib.pyplot as plt
  plt.savefig(f)
  f"))
    (add-to-list 'org-structure-template-alist '("cpp" . "src C++  :includes <iostream>"))
    (add-to-list 'org-structure-template-alist '("cppnm" . "src C++  :main no")))
#+end_src

** Inline latex
Note: I had to install texlive dependencies for latex framents to work. I found what needed to be installed by running =pdflatex= on the generated tex file in =/tmp/= created by org.

*Font size*:
#+begin_src emacs-lisp
  (defconst jmn-latex-scale 1.2 "scaling factor for latex fragments")
  (setq org-format-latex-options (plist-put org-format-latex-options :scale jmn-latex-scale))
#+end_src

Create a function to align the size of displayed latex framents with overall org-mode font size.

#+begin_src emacs-lisp
    (defun update-org-latex-fragments ()
      (org-latex-preview '(64))
      (plist-put org-format-latex-options :scale (+ jmn-latex-scale  (* 0.3 text-scale-mode-amount)))
      (org-latex-preview '(16)))
    (add-hook 'text-scale-mode-hook 'update-org-latex-fragments)
#+end_src

