emacs.html

<div id="outline-container-org5dacab6" class="outline-3">
<h3 id="org5dacab6">Start</h3>
<div class="outline-text-3" id="text-org5dacab6">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org</span>
  <span style="color: #cd8500;">:commands</span> <span style="color: #b16286;">(</span>org-capture org-agenda<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>org-mode . jmn/org-mode-setup<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span>jmn/org-font-setup<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> org-ellipsis <span style="color: #cdbe70;">" &#9662;"</span>
        org-hide-emphasis-markers t
        org-src-fontify-natively t
        org-fontify-quote-and-verse-blocks t
        org-src-tab-acts-natively t
        org-edit-src-content-indentation 2 <span style="color: #98be65;">;; </span><span style="color: #98be65;">I think I undo this somewhere for de/tangling</span>
        org-hide-block-startup nil
        org-src-preserve-indentation nil
        org-startup-folded 'content
        org-cycle-separator-lines 2
        org-capture-bookmark nil
        org-list-indent-offset 1
        org-image-actual-width nil <span style="color: #98be65;">; </span><span style="color: #98be65;">fix to allow picture resizing</span>
        org-return-follows-link t  <span style="color: #98be65;">; </span><span style="color: #98be65;">keep for sure ;@work</span>
        org-use-speed-commands t <span style="color: #98be65;">; </span><span style="color: #98be65;">try out</span>
        <span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> org-agenda-tags-column
      <span style="color: #8ec07c;">(</span>assoc-default <span style="color: #d65d0e;">(</span>system-name<span style="color: #d65d0e;">)</span> '<span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span><span style="color: #cdbe70;">"xps"</span> . 75<span style="color: #458588;">)</span>
                                     <span style="color: #458588;">(</span><span style="color: #cdbe70;">"dsk"</span> . 75<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default is auto</span>
  <span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a100ca" class="outline-3">
<h3 id="org5a100ca">Bullets</h3>
<div class="outline-text-3" id="text-org5a100ca">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">org-bullets</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>org-mode . org-bullets-mode<span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:custom</span>
  <span style="color: #b16286;">(</span>org-bullets-bullet-list '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"&#9673;"</span> <span style="color: #cdbe70;">"&#9675;"</span> <span style="color: #cdbe70;">"&#9679;"</span> <span style="color: #cdbe70;">"&#9675;"</span> <span style="color: #cdbe70;">"&#9679;"</span> <span style="color: #cdbe70;">"&#9675;"</span> <span style="color: #cdbe70;">"&#9679;"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org12d3926" class="outline-3">
<h3 id="org12d3926">Center column</h3>
<div class="outline-text-3" id="text-org12d3926">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">efs/org-mode-visual-fill</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> visual-fill-column-width 100
        visual-fill-column-center-text t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>visual-fill-column-mode 1<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">visual-fill-column</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>org-mode . efs/org-mode-visual-fill<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org418cd75" class="outline-3">
<h3 id="org418cd75">Org-babel</h3>
<div class="outline-text-3" id="text-org418cd75">
<p>
Use # -<b>- org-src-preserve-indentation: t; -</b>- when doing tangle/detangle with python
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>org-babel-do-load-languages 'org-babel-load-languages
                             <span style="color: #b16286;">(</span>append org-babel-load-languages
                                     '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>shell  . t<span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span>python . t<span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span>latex  . t<span style="color: #d65d0e;">)</span>
                                       <span style="color: #d65d0e;">(</span>C      . t<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-confirm-babel-evaluate nil<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">with-eval-after-load</span> 'org
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">This is needed as of Org 9.2</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">org-tempo</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"la"</span> . <span style="color: #cdbe70;">"src latex"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"js"</span> . <span style="color: #cdbe70;">"src js"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"sh"</span> . <span style="color: #cdbe70;">"src shell"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"el"</span> . <span style="color: #cdbe70;">"src emacs-lisp"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"py"</span> . <span style="color: #cdbe70;">"src python  :results output"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"pyim"</span> . <span style="color: #cdbe70;">"src python :results file :var f=strNameWithDoubleQuotes</span>
<span style="color: #cdbe70;">import matplotlib.pyplot as plt</span>
<span style="color: #cdbe70;">plt.savefig(f)</span>
<span style="color: #cdbe70;">f"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"cpp"</span> . <span style="color: #cdbe70;">"src C++  :includes &lt;iostream&gt;"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'org-structure-template-alist '<span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"cppnm"</span> . <span style="color: #cdbe70;">"src C++  :main no"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02394e6" class="outline-3">
<h3 id="org02394e6">Inline latex</h3>
<div class="outline-text-3" id="text-org02394e6">
<p>
Note: I had to install texlive dependencies for latex framents to work. I found what needed to be installed by running <code>pdflatex</code> on the generated tex file in <code>/tmp/</code> created by org.
</p>

<p>
<b>Font size</b>:
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defconst</span> <span style="color: #83a598;">jmn-latex-scale</span> 1.2 <span style="color: #cdbe70;">"scaling factor for latex fragments"</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-format-latex-options <span style="color: #b16286;">(</span>plist-put org-format-latex-options <span style="color: #cd8500;">:scale</span> jmn-latex-scale<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>

<p>
Create a function to align the size of displayed latex framents with overall org-mode font size.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">update-org-latex-fragments</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span>org-latex-preview '<span style="color: #8ec07c;">(</span>64<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>plist-put org-format-latex-options <span style="color: #cd8500;">:scale</span> <span style="color: #8ec07c;">(</span>+ jmn-latex-scale  <span style="color: #d65d0e;">(</span>* 0.3 text-scale-mode-amount<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>org-latex-preview '<span style="color: #8ec07c;">(</span>16<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-hook 'text-scale-mode-hook 'update-org-latex-fragments<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
