emacs.org
** Keybindings
#+begin_src emacs-lisp
  (global-set-key (kbd "C-c l") #'org-store-link)
  (global-set-key (kbd "C-c a") #'org-agenda)
  (global-set-key (kbd "C-c c") #'org-capture)

  (defun org-agenda-show-my-dashboard (&optional arg)
    (interactive "P")
    (org-agenda arg "d"))
#+end_src

** HTML
*** htmlize
For syntax highlighting in export html, we want htmlize version > =1.34=
#+begin_src emacs-lisp
(use-package htmlize)
#+end_src

*** HOLD Save to HTML on save
- 2023-02-11 removing function, trying to not export as often

Figure out how to set this in the header properties rather than hardcoding here.
#+begin_src emacs-lisp :tangle no
  (defun jmn-org-export-html-on-save()
    (interactive)
    (when (member (buffer-file-name)
                  '("/home/ape/.dotfiles/emacs.org"
                    "/home/ape/Code_Project/PyTorchExamples/README.org"))
      (org-html-export-to-html)))

  (add-hook 'after-save-hook 'jmn-org-export-html-on-save)
#+end_src

* Agenda/GTD
