emacs.html

<div id="outline-container-orgd49960a" class="outline-3">
<h3 id="orgd49960a">Keybindings</h3>
<div class="outline-text-3" id="text-orgd49960a">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c l"</span><span style="color: #b16286;">)</span> #'org-store-link<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c a"</span><span style="color: #b16286;">)</span> #'org-agenda<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c c"</span><span style="color: #b16286;">)</span> #'org-capture<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">org-agenda-show-my-dashboard</span> <span style="color: #b16286;">(</span><span style="color: #d3869b;">&amp;optional</span> arg<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span> <span style="color: #cdbe70;">"P"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>org-agenda arg <span style="color: #cdbe70;">"d"</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd345286" class="outline-3">
<h3 id="orgd345286">HTML</h3>
<div class="outline-text-3" id="text-orgd345286">
</div>
<div id="outline-container-org53f923d" class="outline-4">
<h4 id="org53f923d">htmlize</h4>
<div class="outline-text-4" id="text-org53f923d">
<p>
For syntax highlighting in export html, we want htmlize version &gt; <code>1.34</code>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">htmlize</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a9974e" class="outline-4">
<h4 id="org1a9974e"><span class="todo HOLD">HOLD</span> Save to HTML on save</h4>
<div class="outline-text-4" id="text-org1a9974e">
<ul class="org-ul">
<li>2023-02-11 removing function, trying to not export as often</li>
</ul>

<p>
Figure out how to set this in the header properties rather than hardcoding here.
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-org-export-html-on-save</span><span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">when</span> <span style="color: #8ec07c;">(</span>member <span style="color: #d65d0e;">(</span>buffer-file-name<span style="color: #d65d0e;">)</span>
                '<span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"/home/ape/.dotfiles/emacs.org"</span>
                  <span style="color: #cdbe70;">"/home/ape/Code_Project/PyTorchExamples/README.org"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>org-html-export-to-html<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>add-hook 'after-save-hook 'jmn-org-export-html-on-save<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
