emacs.org
** General
Following the tutorial [[https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html][here]].

- =C-c C-s=      :   scheduled timestamp
- =C-c C-d=      :   deadline timestamp
- =C-c C-w=      :   refile actionable/project items from inbox to appropriate area.
- =C-x C-s=      :   org-save-all-org-buffers
- =C-c C-x e=  :   org-set-effort
- =TAB=               :   open  agenda item in other window
- =+=, =-= ,  =,=         :   increase, decrease, and set priority
=Shift-right=  :  advance the todo state

#+begin_src emacs-lisp
  ;; Org Agenda ;; (setq org-agenda-window-setup 'reorganize-frame)
  ;; Exited with ‘q’ or ‘x’ and the old state is restored.
  (setq org-agenda-restore-windows-after-quit 1)
  (setq org-agenda-span 'day)

  ;; SOMEDAY itmes are ommitted from GTD interface on purpose
  (setq org-todo-keywords '((sequence "TODO(t)" "NEXT(n)" "HOLD(h)" "|"
                                      "DONE(d)" "IGNORE(i)")))

  (require 'find-lisp)
  (setq org-directory "~/Documents/gtd/")

  (setq org-agenda-files (find-lisp-find-files org-directory "\.org$"))

  ;; level/maxlevel = order in hierarchy
  (setq org-refile-targets
        '(("projects.org" :maxlevel . 2)
          ("someday.org" :maxlevel . 1)
          ("whip.org" :level . 0)
          ("next.org" :level . 0)))

  ;; https://github.com/syl20bnr/spacemacs/issues/3094
  (setq org-refile-use-outline-path 'file org-outline-path-complete-in-steps nil)
  (setq org-refile-allow-creating-parent-nodes 'confirm)

  (setq org-agenda-prefix-format '((agenda . " %i %-10:c%t [%e]% s ")
                                   (todo . " %i %-10:c [%-4e] ")
                                   (tags . " %i %-12:c")))

  (setq org-deadline-warning-days 30)

  (setq org-agenda-start-with-log-mode t) ;; allows us to see closed in calendar
  (setq org-log-done 'time) ;; creates CLOSED time tag
  (setq org-log-into-drawer t) ;; creates a LOGBOOK drawer for notes

  (setq org-agenda-custom-commands
        '(("d" "Dashboard"
           ((agenda ""
                    ((org-deadline-warning-days 30)))
            (todo "NEXT"
                  ((org-agenda-overriding-header "Next Un-Scheduled Tasks")))
            (todo "TODO"
                  ((org-agenda-overriding-header "Active Un-Scheduled Tasks")))))

          (" " "Agenda"
           ((agenda ""
                    ((org-agenda-span 'day)
                     (org-deadline-warning-days 365)))

            (todo "TODO"
                  ((org-agenda-overriding-header "To Refile")
                   (org-agenda-files (list (concat org-directory "inbox.org")))))

            (todo "NEXT"
                  ((org-agenda-overriding-header "In Progress")
                   (org-agenda-files (list (concat org-directory "projects.org")
                                           (concat org-directory "next.org")
                                           (concat org-directory "inbox.org")))))

            (todo "TODO"
                  ((org-agenda-overriding-header "Projects")
                   (org-agenda-files (list (concat org-directory  "projects.org")))))

            (todo "TODO"
                  ((org-agenda-overriding-header "One-off Tasks")
                   (org-agenda-files (list (concat org-directory  "next.org"))))
                  (org-agenda-skip-function '(org-agenda-skip-entry-if
                                              'deadline 'scheduled)))

            (todo "HOLD"
                      ((org-agenda-overriding-header "HOLD")
                       (org-agenda-files (list (concat org-directory "projects.org")
                                               (concat org-directory "next.org")
                                               (concat org-directory "inbox.org")))))
            ))))

  (defun jmn-someday() "Quick access to someday.org (no links in agenda)"
         (interactive)
         (find-file (concat org-directory "someday.org")))

  ;; remove "C-c a" for something else later?
  (global-set-key (kbd "C-c a") (lambda (&optional args)
                                  (interactive "P")
                                  (org-agenda args " ")))

  (global-set-key (kbd "<f7>") (lambda (&optional args)
                                  (interactive "P")
                                  (org-agenda args " ")))

  (setq org-agenda-todo-ignore-scheduled 'all) ;; cant get it to work for deadlines
#+end_src

