emacs.html

<div id="outline-container-org8497910" class="outline-2">
<h2 id="org8497910">Agenda/GTD</h2>
<div class="outline-text-2" id="text-org8497910">
</div>
<div id="outline-container-org95acf82" class="outline-3">
<h3 id="org95acf82">General</h3>
<div class="outline-text-3" id="text-org95acf82">
<p>
Following the tutorial <a href="https://emacs.cafe/emacs/orgmode/gtd/2017/06/30/orgmode-gtd.html">here</a>.
</p>

<ul class="org-ul">
<li><code>C-c C-s</code>      :   scheduled timestamp</li>
<li><code>C-c C-d</code>      :   deadline timestamp</li>
<li><code>C-c C-w</code>      :   refile actionable/project items from inbox to appropriate area.</li>
<li><code>C-x C-s</code>      :   org-save-all-org-buffers</li>
<li><code>C-c C-x e</code>  :   org-set-effort</li>
<li><code>TAB</code>               :   open  agenda item in other window</li>
<li><code>+</code>, <code>-</code> ,  <code>,</code>         :   increase, decrease, and set priority</li>
</ul>
<p>
<code>Shift-right</code>  :  advance the todo state
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">;; </span><span style="color: #98be65;">Org Agenda ;; (setq org-agenda-window-setup 'reorganize-frame)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">Exited with &#8216;</span><span style="color: #d3869b;">q</span><span style="color: #98be65;">&#8217; or &#8216;</span><span style="color: #d3869b;">x</span><span style="color: #98be65;">&#8217; and the old state is restored.</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-restore-windows-after-quit 1<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-span 'day<span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">SOMEDAY itmes are ommitted from GTD interface on purpose</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-todo-keywords '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>sequence <span style="color: #cdbe70;">"TODO(t)"</span> <span style="color: #cdbe70;">"NEXT(n)"</span> <span style="color: #cdbe70;">"HOLD(h)"</span> <span style="color: #cdbe70;">"|"</span>
                                    <span style="color: #cdbe70;">"DONE(d)"</span> <span style="color: #cdbe70;">"IGNORE(i)"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">find-lisp</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-directory <span style="color: #cdbe70;">"~/Documents/gtd/"</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-files <span style="color: #b16286;">(</span>find-lisp-find-files org-directory <span style="color: #cdbe70;">"</span><span style="color: #fb4933; font-weight: bold;">\</span><span style="color: #cdbe70;">.org$"</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">level/maxlevel = order in hierarchy</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-refile-targets
      '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"projects.org"</span> <span style="color: #cd8500;">:maxlevel</span> . 2<span style="color: #8ec07c;">)</span>
        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"someday.org"</span> <span style="color: #cd8500;">:maxlevel</span> . 1<span style="color: #8ec07c;">)</span>
        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"whip.org"</span> <span style="color: #cd8500;">:level</span> . 0<span style="color: #8ec07c;">)</span>
        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"next.org"</span> <span style="color: #cd8500;">:level</span> . 0<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">https://github.com/syl20bnr/spacemacs/issues/3094</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-refile-use-outline-path 'file org-outline-path-complete-in-steps nil<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-refile-allow-creating-parent-nodes 'confirm<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-prefix-format '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>agenda . <span style="color: #cdbe70;">" %i %-10:c%t [%e]% s "</span><span style="color: #8ec07c;">)</span>
                                 <span style="color: #8ec07c;">(</span>todo . <span style="color: #cdbe70;">" %i %-10:c [%-4e] "</span><span style="color: #8ec07c;">)</span>
                                 <span style="color: #8ec07c;">(</span>tags . <span style="color: #cdbe70;">" %i %-12:c"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-deadline-warning-days 30<span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-start-with-log-mode t<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">allows us to see closed in calendar</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-log-done 'time<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">creates CLOSED time tag</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-log-into-drawer t<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">creates a LOGBOOK drawer for notes</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-custom-commands
      '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"d"</span> <span style="color: #cdbe70;">"Dashboard"</span>
         <span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span>agenda <span style="color: #cdbe70;">""</span>
                  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-deadline-warning-days 30<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"NEXT"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"Next Un-Scheduled Tasks"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"TODO"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"Active Un-Scheduled Tasks"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">" "</span> <span style="color: #cdbe70;">"Agenda"</span>
         <span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span>agenda <span style="color: #cdbe70;">""</span>
                  <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-span 'day<span style="color: #8ec07c;">)</span>
                   <span style="color: #8ec07c;">(</span>org-deadline-warning-days 365<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"TODO"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"To Refile"</span><span style="color: #8ec07c;">)</span>
                 <span style="color: #8ec07c;">(</span>org-agenda-files <span style="color: #d65d0e;">(</span>list <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"NEXT"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"In Progress"</span><span style="color: #8ec07c;">)</span>
                 <span style="color: #8ec07c;">(</span>org-agenda-files <span style="color: #d65d0e;">(</span>list <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"projects.org"</span><span style="color: #458588;">)</span>
                                         <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"next.org"</span><span style="color: #458588;">)</span>
                                         <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"TODO"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"Projects"</span><span style="color: #8ec07c;">)</span>
                 <span style="color: #8ec07c;">(</span>org-agenda-files <span style="color: #d65d0e;">(</span>list <span style="color: #458588;">(</span>concat org-directory  <span style="color: #cdbe70;">"projects.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"TODO"</span>
                <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"One-off Tasks"</span><span style="color: #8ec07c;">)</span>
                 <span style="color: #8ec07c;">(</span>org-agenda-files <span style="color: #d65d0e;">(</span>list <span style="color: #458588;">(</span>concat org-directory  <span style="color: #cdbe70;">"next.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
                <span style="color: #b16286;">(</span>org-agenda-skip-function '<span style="color: #8ec07c;">(</span>org-agenda-skip-entry-if
                                            'deadline 'scheduled<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

          <span style="color: #458588;">(</span>todo <span style="color: #cdbe70;">"HOLD"</span>
                    <span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span>org-agenda-overriding-header <span style="color: #cdbe70;">"HOLD"</span><span style="color: #8ec07c;">)</span>
                     <span style="color: #8ec07c;">(</span>org-agenda-files <span style="color: #d65d0e;">(</span>list <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"projects.org"</span><span style="color: #458588;">)</span>
                                             <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"next.org"</span><span style="color: #458588;">)</span>
                                             <span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
          <span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-someday</span><span style="color: #b16286;">()</span> <span style="color: #cdbe70;">"Quick access to someday.org (no links in agenda)"</span>
       <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
       <span style="color: #b16286;">(</span>find-file <span style="color: #8ec07c;">(</span>concat org-directory <span style="color: #cdbe70;">"someday.org"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">remove "C-c a" for something else later?</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c a"</span><span style="color: #b16286;">)</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #8ec07c;">(</span><span style="color: #d3869b;">&amp;optional</span> args<span style="color: #8ec07c;">)</span>
                                <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">interactive</span> <span style="color: #cdbe70;">"P"</span><span style="color: #8ec07c;">)</span>
                                <span style="color: #8ec07c;">(</span>org-agenda args <span style="color: #cdbe70;">" "</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"&lt;f7&gt;"</span><span style="color: #b16286;">)</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #8ec07c;">(</span><span style="color: #d3869b;">&amp;optional</span> args<span style="color: #8ec07c;">)</span>
                                <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">interactive</span> <span style="color: #cdbe70;">"P"</span><span style="color: #8ec07c;">)</span>
                                <span style="color: #8ec07c;">(</span>org-agenda args <span style="color: #cdbe70;">" "</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-agenda-todo-ignore-scheduled 'all<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">cant get it to work for deadlines</span>
</pre>
</div>
</div>
</div>
