emacs.org
** Habits
File holding habits must be added to =org-agenda-files= above
- habits must have the =:STYLE: habit= property
#+begin_src emacs-lisp
  ;; org habit;;
  (require 'org-habit)
  (add-to-list 'org-modules 'org-habit)
  (setq org-habit-graph-column
        (assoc-default (system-name) '(("xps" . 56)
                                       ("dsk" . 52)))) ;; default is 40
#+end_src

** Capture Templates
[[https://orgmode.org/manual/Capture-templates.html][Capture templates (The Org Manual)]]
- =C-c c i=  :   add an entry to the inbox
- =C-c c w=  :   add an entry to the whip
  - Creates a time stamp for now, need to add time for when I'd like to be reminded, =C-c .=
  - =C-c C-c= : adds tags to a heading

#+begin_src emacs-lisp
  (setq org-capture-templates
        `(("t" "Todo [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* TODO %i%?" :empty-lines 1)

          ("T" "Todo Today [inbox]" entry
             (file ,(concat org-directory "inbox.org"))
             "* TODO %?\nDEADLINE: %t" :empty-lines 1)

          ("l" "Linked Todo [inbox]" entry
           (file ,(concat org-directory "inbox.org"))
           "* TODO %i%? \n %a" :empty-lines 1)

          ("s" "Schedule" entry
           (file+headline ,(concat org-directory "whip.org")  "Whip")
           "* %i%? \n %U %^t" :empty-lines 1)

          ("j" "Journal" entry
           (file+datetree ,(concat org-directory "journal.org"))
           "* %?\nEntered on %U\n  %i\n  %a"  :empty-lines 1)))
#+end_src

** Archive
#+begin_src emacs-lisp
  (defun org-archive-done-tasks-tree ()
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
     "/DONE" 'tree))

  (defun org-archive-done-tasks-file ()
    (interactive)
    (org-map-entries
     (lambda ()
       (org-archive-subtree)
       (setq org-map-continue-from (org-element-property :begin (org-element-at-point))))
     "/DONE" 'file))

#+end_src

** Process Inbox Item
https://github.com/jethrokuan/.emacs.d/blob/master/init.el
#+begin_src emacs-lisp
  ;; could set in the inbox header instead (where tags are set)
  (customize-set-variable 'org-global-properties
                          '(("Effort_ALL" . "0:05 0:15 0:30 1:00 2:00 4:00")))

  (defun jmn/org-agenda-process-inbox-item ()
    "Process a single item in the org-agenda."
    (interactive)
    (org-with-wide-buffer  ; what does this do?
     ;; (org-agenda-set-tags) ; may want in the future
     (org-agenda-priority)
     (org-agenda-set-effort)
     (org-agenda-refile nil nil t)))

  (global-set-key (kbd "C-c p") 'jmn/org-agenda-process-inbox-item)
#+end_src

