emacs.html

<div id="outline-container-org93b48e7" class="outline-3">
<h3 id="org93b48e7">Habits</h3>
<div class="outline-text-3" id="text-org93b48e7">
<p>
File holding habits must be added to <code>org-agenda-files</code> above
</p>
<ul class="org-ul">
<li>habits must have the <code>:STYLE: habit</code> property</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">;; </span><span style="color: #98be65;">org habit;;</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">require</span> '<span style="color: #d3869b;">org-habit</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>add-to-list 'org-modules 'org-habit<span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-habit-graph-column
      <span style="color: #b16286;">(</span>assoc-default <span style="color: #8ec07c;">(</span>system-name<span style="color: #8ec07c;">)</span> '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"xps"</span> . 56<span style="color: #d65d0e;">)</span>
                                     <span style="color: #d65d0e;">(</span><span style="color: #cdbe70;">"dsk"</span> . 52<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default is 40</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga01ce55" class="outline-3">
<h3 id="orga01ce55">Capture Templates</h3>
<div class="outline-text-3" id="text-orga01ce55">
<p>
<a href="https://orgmode.org/manual/Capture-templates.html">Capture templates (The Org Manual)</a>
</p>
<ul class="org-ul">
<li><code>C-c c i</code>  :   add an entry to the inbox</li>
<li><code>C-c c w</code>  :   add an entry to the whip
<ul class="org-ul">
<li>Creates a time stamp for now, need to add time for when I'd like to be reminded, <code>C-c .</code></li>
<li><code>C-c C-c</code> : adds tags to a heading</li>
</ul></li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> org-capture-templates
      `<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"t"</span> <span style="color: #cdbe70;">"Todo [inbox]"</span> entry
         <span style="color: #d65d0e;">(</span>file ,<span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
         <span style="color: #cdbe70;">"* TODO %i%?"</span> <span style="color: #cd8500;">:empty-lines</span> 1<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"T"</span> <span style="color: #cdbe70;">"Todo Today [inbox]"</span> entry
           <span style="color: #d65d0e;">(</span>file ,<span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
           <span style="color: #cdbe70;">"* TODO %?\nDEADLINE: %t"</span> <span style="color: #cd8500;">:empty-lines</span> 1<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"l"</span> <span style="color: #cdbe70;">"Linked Todo [inbox]"</span> entry
         <span style="color: #d65d0e;">(</span>file ,<span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"inbox.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
         <span style="color: #cdbe70;">"* TODO %i%? \n %a"</span> <span style="color: #cd8500;">:empty-lines</span> 1<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"s"</span> <span style="color: #cdbe70;">"Schedule"</span> entry
         <span style="color: #d65d0e;">(</span>file+headline ,<span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"whip.org"</span><span style="color: #458588;">)</span>  <span style="color: #cdbe70;">"Whip"</span><span style="color: #d65d0e;">)</span>
         <span style="color: #cdbe70;">"* %i%? \n %U %^t"</span> <span style="color: #cd8500;">:empty-lines</span> 1<span style="color: #8ec07c;">)</span>

        <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"j"</span> <span style="color: #cdbe70;">"Journal"</span> entry
         <span style="color: #d65d0e;">(</span>file+datetree ,<span style="color: #458588;">(</span>concat org-directory <span style="color: #cdbe70;">"journal.org"</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
         <span style="color: #cdbe70;">"* %?\nEntered on %U\n  %i\n  %a"</span>  <span style="color: #cd8500;">:empty-lines</span> 1<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb3de694" class="outline-3">
<h3 id="orgb3de694">Archive</h3>
<div class="outline-text-3" id="text-orgb3de694">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">org-archive-done-tasks-tree</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>org-map-entries
   <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #d65d0e;">()</span>
     <span style="color: #d65d0e;">(</span>org-archive-subtree<span style="color: #d65d0e;">)</span>
     <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">setq</span> org-map-continue-from <span style="color: #458588;">(</span>org-element-property <span style="color: #cd8500;">:begin</span> <span style="color: #b16286;">(</span>org-element-at-point<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
   <span style="color: #cdbe70;">"/DONE"</span> 'tree<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">org-archive-done-tasks-file</span> <span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>org-map-entries
   <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #d65d0e;">()</span>
     <span style="color: #d65d0e;">(</span>org-archive-subtree<span style="color: #d65d0e;">)</span>
     <span style="color: #d65d0e;">(</span><span style="color: #fb4933;">setq</span> org-map-continue-from <span style="color: #458588;">(</span>org-element-property <span style="color: #cd8500;">:begin</span> <span style="color: #b16286;">(</span>org-element-at-point<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
   <span style="color: #cdbe70;">"/DONE"</span> 'file<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org95217d9" class="outline-3">
<h3 id="org95217d9">Process Inbox Item</h3>
<div class="outline-text-3" id="text-org95217d9">
<p>
<a href="https://github.com/jethrokuan/.emacs.d/blob/master/init.el">https://github.com/jethrokuan/.emacs.d/blob/master/init.el</a>
</p>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #98be65;">;; </span><span style="color: #98be65;">could set in the inbox header instead (where tags are set)</span>
<span style="color: #458588;">(</span>customize-set-variable 'org-global-properties
                        '<span style="color: #b16286;">(</span><span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"Effort_ALL"</span> . <span style="color: #cdbe70;">"0:05 0:15 0:30 1:00 2:00 4:00"</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn/org-agenda-process-inbox-item</span> <span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Process a single item in the org-agenda."</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">org-with-wide-buffer</span>  <span style="color: #98be65;">; </span><span style="color: #98be65;">what does this do?</span>
   <span style="color: #98be65;">;; </span><span style="color: #98be65;">(org-agenda-set-tags) ; may want in the future</span>
   <span style="color: #8ec07c;">(</span>org-agenda-priority<span style="color: #8ec07c;">)</span>
   <span style="color: #8ec07c;">(</span>org-agenda-set-effort<span style="color: #8ec07c;">)</span>
   <span style="color: #8ec07c;">(</span>org-agenda-refile nil nil t<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-c p"</span><span style="color: #b16286;">)</span> 'jmn/org-agenda-process-inbox-item<span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
