emacs.org
** Advice
#+begin_src emacs-lisp
  (defmacro func-ignore (fnc)
    "Return function that ignores its arguments and invokes FNC."
    `(lambda (&rest _rest)
       (funcall ,fnc)))

  (advice-add 'org-archive-done-tasks-tree
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-archive-done-tasks-file
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-refile
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-deadline
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-schedule
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-store-log-note
              :after (func-ignore #'org-save-all-org-buffers))
  (advice-add 'org-todo
              :after (func-ignore #'org-save-all-org-buffers))

  ;; if agenda is already open, update it with new capture;; work?
  (advice-add 'org-capture-finalize
               :after (func-ignore #'org-agenda-redo-all))
  ;; ;; (advice-add 'org-capture-finalize
  ;; ;;             :after (func-ignore #'org-agenda-redo-all))


#+end_src

* Terminals
** vterm
Faster terminal due to being compiled. Default is a better mode than term-mode; it's like a Char-mode but with ability to access function list with M-x.  [[https://github.com/akermu/emacs-libvterm][vterm Documentation]]
- For more than one terminal, you must M-x rename-uniquely the terminal.
- C-c prefix for term commands
- C-c C-c = send C-c to the terminal (kill running command)

#+begin_src emacs-lisp
  (use-package vterm
    :commands vterm
    :defer t
    :bind (:map vterm-mode-map ("C-o" . other-window))
    :config
    ;;(setq term-prompt-regexp "^[^$]*[$] *");; match your custom shell
    ;;(setq vterm-shell "zsh");; Set this to customize the shell to launch
    (setq vterm-max-scrollback 10000))

  (use-package vterm-toggle
    :after vterm
    :config
    (setq vterm-toggle-fullscreen-p nil)
    (add-to-list 'display-buffer-alist
                 '((lambda(bufname _) (with-current-buffer bufname (equal major-mode 'vterm-mode)))
                   (display-buffer-reuse-window display-buffer-at-bottom)
                   ;;(display-buffer-reuse-window display-buffer-in-direction)
                   ;;display-buffer-in-direction/direction/dedicated is added in emacs27
                   ;;(direction . bottom)
                   ;;(dedicated . t) ;dedicated is supported in emacs27
                   (reusable-frames . visible)
                   (window-height . 0.3)))
    )

  ;; (global-unset-key (kbd "C-t"))`
  (global-set-key (kbd "C-`") 'vterm-toggle)

#+end_src

** term-mode
- Slower than vterm at printing large amounts of information. 
- For more than one terminal, you must M-x rename-uniquely the terminal.
- C-c prefix for term commands

Line-mode vs char-mode *selection shows on the modeline*:
C-c C-k -> char-mode
C-c C-j  -> line-mode
*** Better term-mode colors
#+begin_src emacs-lisp
(use-package eterm-256color
  :hook (term-mode . eterm-256color-mode))
#+end_src

*** Keybindings
Just some changes to make it feel more like the other modes.
 - I don't really use the =M-p= nor the =M-n=, but they could be nice.
#+begin_src emacs-lisp
  (with-eval-after-load 'term
    (define-key term-raw-map (kbd "C-o") 'other-window)
     (define-key term-raw-map (kbd "M-o") 'previous-multiframe-window)

     ;; access prev commandsin line mode, though line and char-mode rings are separate
     (define-key term-raw-map (kbd "M-p") 'term-send-up)
     (define-key term-raw-map (kbd "M-n") 'term-send-down)

     ;; add "C-x" as escape character and use it for keybindings
     (let (term-escape-char)
                               (term-set-escape-char ?\C-x))
     (define-key term-raw-map (kbd "C-x C-k") ' kill-current-buffer))
#+end_src

* Theme
