emacs.html

<div id="outline-container-orgfe88532" class="outline-3">
<h3 id="orgfe88532">Advice</h3>
<div class="outline-text-3" id="text-orgfe88532">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defmacro</span> <span style="color: #fabd2f;">func-ignore</span> <span style="color: #b16286;">(</span>fnc<span style="color: #b16286;">)</span>
  <span style="color: #cdbe70;">"Return function that ignores its arguments and invokes FNC."</span>
  `<span style="color: #b16286;">(</span><span style="color: #fb4933;">lambda</span> <span style="color: #8ec07c;">(</span><span style="color: #d3869b;">&amp;rest</span> _rest<span style="color: #8ec07c;">)</span>
     <span style="color: #8ec07c;">(</span>funcall ,fnc<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span>advice-add 'org-archive-done-tasks-tree
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-archive-done-tasks-file
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-refile
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-deadline
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-schedule
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-store-log-note
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span>advice-add 'org-todo
            <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-save-all-org-buffers<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">if agenda is already open, update it with new capture;; work?</span>
<span style="color: #458588;">(</span>advice-add 'org-capture-finalize
             <span style="color: #cd8500;">:after</span> <span style="color: #b16286;">(</span><span style="color: #fb4933;">func-ignore</span> #'org-agenda-redo-all<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">;; (advice-add 'org-capture-finalize</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">;;             :after (func-ignore #'org-agenda-redo-all))</span>


</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7be3bb9" class="outline-2">
<h2 id="org7be3bb9">Terminals</h2>
<div class="outline-text-2" id="text-org7be3bb9">
</div>
<div id="outline-container-org342ac24" class="outline-3">
<h3 id="org342ac24">vterm</h3>
<div class="outline-text-3" id="text-org342ac24">
<p>
Faster terminal due to being compiled. Default is a better mode than term-mode; it's like a Char-mode but with ability to access function list with M-x.  <a href="https://github.com/akermu/emacs-libvterm">vterm Documentation</a>
</p>
<ul class="org-ul">
<li>For more than one terminal, you must M-x rename-uniquely the terminal.</li>
<li>C-c prefix for term commands</li>
<li>C-c C-c = send C-c to the terminal (kill running command)</li>
</ul>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">vterm</span>
  <span style="color: #cd8500;">:commands</span> vterm
  <span style="color: #cd8500;">:defer</span> t
  <span style="color: #cd8500;">:bind</span> <span style="color: #b16286;">(</span><span style="color: #cd8500;">:map</span> vterm-mode-map <span style="color: #8ec07c;">(</span><span style="color: #cdbe70;">"C-o"</span> . other-window<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #cd8500;">:config</span>
  <span style="color: #98be65;">;;</span><span style="color: #98be65;">(setq term-prompt-regexp "^[</span><span style="color: #98be65;">^</span><span style="color: #98be65;">$]*[$] *");; match your custom shell</span>
  <span style="color: #98be65;">;;</span><span style="color: #98be65;">(setq vterm-shell "zsh");; Set this to customize the shell to launch</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> vterm-max-scrollback 10000<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">vterm-toggle</span>
  <span style="color: #cd8500;">:after</span> vterm
  <span style="color: #cd8500;">:config</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">setq</span> vterm-toggle-fullscreen-p nil<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>add-to-list 'display-buffer-alist
               '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span><span style="color: #fb4933;">lambda</span><span style="color: #458588;">(</span>bufname _<span style="color: #458588;">)</span> <span style="color: #458588;">(</span><span style="color: #fb4933;">with-current-buffer</span> bufname <span style="color: #b16286;">(</span>equal major-mode 'vterm-mode<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span>
                 <span style="color: #d65d0e;">(</span>display-buffer-reuse-window display-buffer-at-bottom<span style="color: #d65d0e;">)</span>
                 <span style="color: #98be65;">;;</span><span style="color: #98be65;">(display-buffer-reuse-window display-buffer-in-direction)</span>
                 <span style="color: #98be65;">;;</span><span style="color: #98be65;">display-buffer-in-direction/direction/dedicated is added in emacs27</span>
                 <span style="color: #98be65;">;;</span><span style="color: #98be65;">(direction . bottom)</span>
                 <span style="color: #98be65;">;;</span><span style="color: #98be65;">(dedicated . t) ;dedicated is supported in emacs27</span>
                 <span style="color: #d65d0e;">(</span>reusable-frames . visible<span style="color: #d65d0e;">)</span>
                 <span style="color: #d65d0e;">(</span>window-height . 0.3<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #458588;">)</span>

<span style="color: #98be65;">;; </span><span style="color: #98be65;">(global-unset-key (kbd "C-t"))`</span>
<span style="color: #458588;">(</span>global-set-key <span style="color: #b16286;">(</span>kbd <span style="color: #cdbe70;">"C-`"</span><span style="color: #b16286;">)</span> 'vterm-toggle<span style="color: #458588;">)</span>

</pre>
</div>
</div>
</div>

<div id="outline-container-org61769e1" class="outline-3">
<h3 id="org61769e1">term-mode</h3>
<div class="outline-text-3" id="text-org61769e1">
<ul class="org-ul">
<li>Slower than vterm at printing large amounts of information.</li>
<li>For more than one terminal, you must M-x rename-uniquely the terminal.</li>
<li>C-c prefix for term commands</li>
</ul>

<p>
Line-mode vs char-mode <b>selection shows on the modeline</b>:
C-c C-k -&gt; char-mode
C-c C-j  -&gt; line-mode
</p>
</div>
<div id="outline-container-orgdc652a2" class="outline-4">
<h4 id="orgdc652a2">Better term-mode colors</h4>
<div class="outline-text-4" id="text-orgdc652a2">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">eterm-256color</span>
  <span style="color: #cd8500;">:hook</span> <span style="color: #b16286;">(</span>term-mode . eterm-256color-mode<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2006893" class="outline-4">
<h4 id="org2006893">Keybindings</h4>
<div class="outline-text-4" id="text-org2006893">
<p>
Just some changes to make it feel more like the other modes.
</p>
<ul class="org-ul">
<li>I don't really use the <code>M-p</code> nor the <code>M-n</code>, but they could be nice.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">with-eval-after-load</span> 'term
  <span style="color: #b16286;">(</span>define-key term-raw-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"C-o"</span><span style="color: #8ec07c;">)</span> 'other-window<span style="color: #b16286;">)</span>
   <span style="color: #b16286;">(</span>define-key term-raw-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"M-o"</span><span style="color: #8ec07c;">)</span> 'previous-multiframe-window<span style="color: #b16286;">)</span>

   <span style="color: #98be65;">;; </span><span style="color: #98be65;">access prev commandsin line mode, though line and char-mode rings are separate</span>
   <span style="color: #b16286;">(</span>define-key term-raw-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"M-p"</span><span style="color: #8ec07c;">)</span> 'term-send-up<span style="color: #b16286;">)</span>
   <span style="color: #b16286;">(</span>define-key term-raw-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"M-n"</span><span style="color: #8ec07c;">)</span> 'term-send-down<span style="color: #b16286;">)</span>

   <span style="color: #98be65;">;; </span><span style="color: #98be65;">add "C-x" as escape character and use it for keybindings</span>
   <span style="color: #b16286;">(</span><span style="color: #fb4933;">let</span> <span style="color: #8ec07c;">(</span>term-escape-char<span style="color: #8ec07c;">)</span>
                             <span style="color: #8ec07c;">(</span>term-set-escape-char ?\C-x<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
   <span style="color: #b16286;">(</span>define-key term-raw-map <span style="color: #8ec07c;">(</span>kbd <span style="color: #cdbe70;">"C-x C-k"</span><span style="color: #8ec07c;">)</span> ' kill-current-buffer<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
