emacs.org
** Setup and helpers

#+begin_src emacs-lisp
(setq custom-safe-themes t) ;; don't ask if theme is safe
#+end_src

#+begin_src emacs-lisp
  (defun jmn-disable-theme()
    (interactive)
    (disable-theme (car custom-enabled-themes)))
#+end_src

** Themes
