emacs.html

<div id="outline-container-orgb9298ac" class="outline-2">
<h2 id="orgb9298ac">Theme</h2>
<div class="outline-text-2" id="text-orgb9298ac">
</div>
<div id="outline-container-org60b73bb" class="outline-3">
<h3 id="org60b73bb">Setup and helpers</h3>
<div class="outline-text-3" id="text-org60b73bb">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">setq</span> custom-safe-themes t<span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">don't ask if theme is safe</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-disable-theme</span><span style="color: #b16286;">()</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
