emacs.org
*** Gruvbox
#+begin_src emacs-lisp
  (use-package gruvbox-theme)

  (defun jmn-set-gruv-org-faces (props)
    "Function used by all gruvbox themes for setting or faces"

    (with-eval-after-load 'org
      (set-face-foreground 'org-priority (face-foreground font-lock-constant-face))
      (set-face-foreground 'org-agenda-done (alist-get 'done-color props))
      (set-face-foreground 'org-headline-done (alist-get 'done-color props))
      (set-face-foreground 'org-done (alist-get 'done-color props))

      (setq org-todo-keyword-faces
            `(("NEXT" . ,(face-foreground font-lock-function-name-face))
              ("HOLD" . ,(face-foreground font-lock-builtin-face))
              ("DONE" . ,(alist-get 'done-color props))))

      (if (alist-get 'org-block props)
          (set-face-background 'org-block (alist-get 'org-block props)))))


  (defun jmn-load-gruvbox-dark-medium ()
    "Theme for dark time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'gruvbox-dark-medium t)
    (set-face-background 'line-number
                         (face-attribute 'default :background))

     (set-face-foreground 'default "gray75") ;; default "#ebdbb2"
    (set-face-foreground 'default "moccasin") ;; default "#ebdbb2"

      (jmn-set-gruv-org-faces '((done-color . "gray35" ))))


  (defun jmn-load-gruvbox-dark-hard ()
    "Theme for very dark time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'gruvbox-dark-hard t)
    (set-face-background 'line-number
                         (face-attribute 'default :background))

    ;; (set-face-foreground 'default "PeachPuff3") ;; default "#ebdbb2"
    ;; (set-face-foreground 'default "gray75") ;; default "#ebdbb2"
    ;; (set-face-foreground 'default "moccasin") ;; default "#ebdbb2"
    (set-face-foreground 'default "bisque2") ;; default "#ebdbb2"
    (set-face-foreground 'font-lock-comment-face  "#98be65") ;; default "#ebdbb2"
    (set-face-foreground 'font-lock-string-face  "LightGoldenrod3")
    (set-face-foreground 'font-lock-builtin-face  "Orange3")
    (jmn-set-gruv-org-faces '((done-color . "gray35" )
                              (org-block . "#282828"))))


  (defun jmn-load-gruvbox-light-medium()
    "Theme for light time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'gruvbox-light-medium t)

    (jmn-set-gruv-org-faces '((done-color . "Navajowhite3" ))))

  (defun jmn-load-gruvbox-light-hard()
    "Theme for very light time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'gruvbox-light-hard t)

    (jmn-set-gruv-org-faces '((done-color . "Navajowhite3" )
                              (org-block . "#fbf1c7")))) ;; default "#f9f5d7"

    (defun jmn-load-gruvbox-light-soft()
    "Theme for very light time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'gruvbox-light-soft t)

    (jmn-set-gruv-org-faces '((done-color . "Navajowhite3" )
                              (org-block . "#ebdbb2")))) ;; default "#f9f5d7"

#+end_src

