emacs.html

<div id="outline-container-org93caef9" class="outline-3">
<h3 id="org93caef9">Themes</h3>
<div class="outline-text-3" id="text-org93caef9">
</div>
<div id="outline-container-orgdd51420" class="outline-4">
<h4 id="orgdd51420">Gruvbox</h4>
<div class="outline-text-4" id="text-orgdd51420">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">gruvbox-theme</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-set-gruv-org-faces</span> <span style="color: #b16286;">(</span>props<span style="color: #b16286;">)</span>
  <span style="color: #cdbe70;">"Function used by all gruvbox themes for setting or faces"</span>

  <span style="color: #b16286;">(</span><span style="color: #fb4933;">with-eval-after-load</span> 'org
    <span style="color: #8ec07c;">(</span>set-face-foreground 'org-priority <span style="color: #d65d0e;">(</span>face-foreground font-lock-constant-face<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>set-face-foreground 'org-agenda-done <span style="color: #d65d0e;">(</span>alist-get 'done-color props<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>set-face-foreground 'org-headline-done <span style="color: #d65d0e;">(</span>alist-get 'done-color props<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
    <span style="color: #8ec07c;">(</span>set-face-foreground 'org-done <span style="color: #d65d0e;">(</span>alist-get 'done-color props<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>

    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">setq</span> org-todo-keyword-faces
          `<span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span><span style="color: #cdbe70;">"NEXT"</span> . ,<span style="color: #b16286;">(</span>face-foreground font-lock-function-name-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
            <span style="color: #458588;">(</span><span style="color: #cdbe70;">"HOLD"</span> . ,<span style="color: #b16286;">(</span>face-foreground font-lock-builtin-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
            <span style="color: #458588;">(</span><span style="color: #cdbe70;">"DONE"</span> . ,<span style="color: #b16286;">(</span>alist-get 'done-color props<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>

    <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">if</span> <span style="color: #d65d0e;">(</span>alist-get 'org-block props<span style="color: #d65d0e;">)</span>
        <span style="color: #d65d0e;">(</span>set-face-background 'org-block <span style="color: #458588;">(</span>alist-get 'org-block props<span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>


<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-gruvbox-dark-medium</span> <span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for dark time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'gruvbox-dark-medium t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-background 'line-number
                       <span style="color: #8ec07c;">(</span>face-attribute 'default <span style="color: #cd8500;">:background</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>

   <span style="color: #b16286;">(</span>set-face-foreground 'default <span style="color: #cdbe70;">"gray75"</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#ebdbb2"</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'default <span style="color: #cdbe70;">"moccasin"</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#ebdbb2"</span>

    <span style="color: #b16286;">(</span>jmn-set-gruv-org-faces '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>done-color . <span style="color: #cdbe70;">"gray35"</span> <span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>


<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-gruvbox-dark-hard</span> <span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for very dark time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'gruvbox-dark-hard t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-background 'line-number
                       <span style="color: #8ec07c;">(</span>face-attribute 'default <span style="color: #cd8500;">:background</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>

  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(set-face-foreground 'default "PeachPuff3") ;; default "#ebdbb2"</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(set-face-foreground 'default "gray75") ;; default "#ebdbb2"</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">(set-face-foreground 'default "moccasin") ;; default "#ebdbb2"</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'default <span style="color: #cdbe70;">"bisque2"</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#ebdbb2"</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'font-lock-comment-face  <span style="color: #cdbe70;">"#98be65"</span><span style="color: #b16286;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#ebdbb2"</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'font-lock-string-face  <span style="color: #cdbe70;">"LightGoldenrod3"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'font-lock-builtin-face  <span style="color: #cdbe70;">"Orange3"</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>jmn-set-gruv-org-faces '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>done-color . <span style="color: #cdbe70;">"gray35"</span> <span style="color: #d65d0e;">)</span>
                            <span style="color: #d65d0e;">(</span>org-block . <span style="color: #cdbe70;">"#282828"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>


<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-gruvbox-light-medium</span><span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for light time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'gruvbox-light-medium t<span style="color: #b16286;">)</span>

  <span style="color: #b16286;">(</span>jmn-set-gruv-org-faces '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>done-color . <span style="color: #cdbe70;">"Navajowhite3"</span> <span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-gruvbox-light-hard</span><span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for very light time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'gruvbox-light-hard t<span style="color: #b16286;">)</span>

  <span style="color: #b16286;">(</span>jmn-set-gruv-org-faces '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>done-color . <span style="color: #cdbe70;">"Navajowhite3"</span> <span style="color: #d65d0e;">)</span>
                            <span style="color: #d65d0e;">(</span>org-block . <span style="color: #cdbe70;">"#fbf1c7"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#f9f5d7"</span>

  <span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-gruvbox-light-soft</span><span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for very light time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'gruvbox-light-soft t<span style="color: #b16286;">)</span>

  <span style="color: #b16286;">(</span>jmn-set-gruv-org-faces '<span style="color: #8ec07c;">(</span><span style="color: #d65d0e;">(</span>done-color . <span style="color: #cdbe70;">"Navajowhite3"</span> <span style="color: #d65d0e;">)</span>
                            <span style="color: #d65d0e;">(</span>org-block . <span style="color: #cdbe70;">"#ebdbb2"</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span> <span style="color: #98be65;">;; </span><span style="color: #98be65;">default "#f9f5d7"</span>

</pre>
</div>
</div>
</div>
