emacs.org
*** Dark+
- The modeline, when un-selected, has the same background as files, making it hard to delineation between vertically split windows.
#+begin_src emacs-lisp :tangle no
  (use-package doom-themes)

  (defun jmn-load-dark+()
    "Theme for very light time"
    (interactive)
    (disable-theme (car custom-enabled-themes))
    (load-theme 'doom-dark+ t)
    (set-face-background 'line-number
                         (face-attribute 'default :background))
    ;; default does not change filename settings when modified
    (set-face-foreground 'doom-modeline-buffer-modified "red"))
#+end_src

*** Doom-one
#+begin_src emacs-lisp
    (use-package doom-themes)
  (defun jmn-load-doom-one()
      "doom-one for dark time"
      (interactive)
      (disable-theme (car custom-enabled-themes))
      (load-theme 'doom-one)
      (with-eval-after-load 'org
        (set-face-foreground 'org-priority (face-foreground font-lock-builtin-face))
        (setq org-todo-keyword-faces
              `(("NEXT" .  ,(face-foreground font-lock-type-face))
                ("HOLD" . ,(face-foreground font-lock-variable-name-face))))))


    (defun jmn-load-doom-one-light()
      "doom-one for light time"
      (interactive)
      (disable-theme (car custom-enabled-themes))
      (load-theme 'doom-one-light)
      (with-eval-after-load 'org
        (setq org-todo-keyword-faces
              `(("NEXT" .  ,(face-foreground font-lock-type-face))
                ("HOLD" . ,(face-foreground font-lock-variable-name-face))))))
#+end_src

** Default and time switches
#+begin_src emacs-lisp
   (jmn-load-gruvbox-dark-hard)
  ;; (run-at-time "7:00 am" nil #'jmn-load-doom-one-light)
  ;; (run-at-time "4:30 pm" nil #'jmn-load-doom-one)
#+end_src

* Localwords                                                       :noexport:
#  LocalWords:  IDE solarized gruvbox vertico Magit Quickhelp Elpy Elisp Neotree Greduan's Localwords Esc  Smartparens UI Helpful's Yasnippet LSP Modeline Dap Flycheck modeline Treemacs backend lsp vterm eshell  Dired dracula clangd ui
#  LocalWords:  Grammarly workspaces commenter Pyright CMake Flyspell
#  LocalWords:  Pyvenv treemacs shellcheck Linum Proced
