emacs.html

<div id="outline-container-org4bd70c8" class="outline-4">
<h4 id="org4bd70c8">Dark+</h4>
<div class="outline-text-4" id="text-org4bd70c8">
<ul class="org-ul">
<li>The modeline, when un-selected, has the same background as files, making it hard to delineation between vertically split windows.</li>
</ul>
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">doom-themes</span><span style="color: #458588;">)</span>

<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-dark+</span><span style="color: #b16286;">()</span>
  <span style="color: #cdbe70;">"Theme for very light time"</span>
  <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>load-theme 'doom-dark+ t<span style="color: #b16286;">)</span>
  <span style="color: #b16286;">(</span>set-face-background 'line-number
                       <span style="color: #8ec07c;">(</span>face-attribute 'default <span style="color: #cd8500;">:background</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
  <span style="color: #98be65;">;; </span><span style="color: #98be65;">default does not change filename settings when modified</span>
  <span style="color: #b16286;">(</span>set-face-foreground 'doom-modeline-buffer-modified <span style="color: #cdbe70;">"red"</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1a5d876" class="outline-4">
<h4 id="org1a5d876">Doom-one</h4>
<div class="outline-text-4" id="text-org1a5d876">
<div class="org-src-container">
<pre class="src src-emacs-lisp">  <span style="color: #458588;">(</span><span style="color: #fb4933;">use-package</span> <span style="color: #d3869b;">doom-themes</span><span style="color: #458588;">)</span>
<span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-doom-one</span><span style="color: #b16286;">()</span>
    <span style="color: #cdbe70;">"doom-one for dark time"</span>
    <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span>load-theme 'doom-one<span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span><span style="color: #fb4933;">with-eval-after-load</span> 'org
      <span style="color: #8ec07c;">(</span>set-face-foreground 'org-priority <span style="color: #d65d0e;">(</span>face-foreground font-lock-builtin-face<span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span>
      <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">setq</span> org-todo-keyword-faces
            `<span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span><span style="color: #cdbe70;">"NEXT"</span> .  ,<span style="color: #b16286;">(</span>face-foreground font-lock-type-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
              <span style="color: #458588;">(</span><span style="color: #cdbe70;">"HOLD"</span> . ,<span style="color: #b16286;">(</span>face-foreground font-lock-variable-name-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>


  <span style="color: #458588;">(</span><span style="color: #fb4933;">defun</span> <span style="color: #fabd2f;">jmn-load-doom-one-light</span><span style="color: #b16286;">()</span>
    <span style="color: #cdbe70;">"doom-one for light time"</span>
    <span style="color: #b16286;">(</span><span style="color: #fb4933;">interactive</span><span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span>disable-theme <span style="color: #8ec07c;">(</span>car custom-enabled-themes<span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span>load-theme 'doom-one-light<span style="color: #b16286;">)</span>
    <span style="color: #b16286;">(</span><span style="color: #fb4933;">with-eval-after-load</span> 'org
      <span style="color: #8ec07c;">(</span><span style="color: #fb4933;">setq</span> org-todo-keyword-faces
            `<span style="color: #d65d0e;">(</span><span style="color: #458588;">(</span><span style="color: #cdbe70;">"NEXT"</span> .  ,<span style="color: #b16286;">(</span>face-foreground font-lock-type-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
              <span style="color: #458588;">(</span><span style="color: #cdbe70;">"HOLD"</span> . ,<span style="color: #b16286;">(</span>face-foreground font-lock-variable-name-face<span style="color: #b16286;">)</span><span style="color: #458588;">)</span><span style="color: #d65d0e;">)</span><span style="color: #8ec07c;">)</span><span style="color: #b16286;">)</span><span style="color: #458588;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4d4b6bf" class="outline-3">
<h3 id="org4d4b6bf">Default and time switches</h3>
<div class="outline-text-3" id="text-org4d4b6bf">
<div class="org-src-container">
<pre class="src src-emacs-lisp"> <span style="color: #458588;">(</span>jmn-load-gruvbox-dark-hard<span style="color: #458588;">)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(run-at-time "7:00 am" nil #'jmn-load-doom-one-light)</span>
<span style="color: #98be65;">;; </span><span style="color: #98be65;">(run-at-time "4:30 pm" nil #'jmn-load-doom-one)</span>
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: ape</p>
<p class="date">Created: 2023-03-12 Sun 18:58</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
